drop function report_pood17;--get full_name ap_member report_pood17

CREATE OR REPLACE FUNCTION erp.report_pood17(p_lin_id character varying, p_pur_ord_master_id integer)
 RETURNS TABLE(pur_ord_master_id integer, h1 character varying, h2 character varying, h3 character varying, d1 character varying, d1_1 character varying, d1_2 character varying, d2 character varying, d2_1 character varying, d2_2 character varying, d3 character varying, d3_0 character varying, d3_1 character varying, d3_2 character varying, d3_3 character varying, d3_4 character varying, d3_5 character varying, d3_f1 character varying, d3_f2 character varying, d3_f3 character varying, d4 character varying, d4_1 character varying, d5 character varying, d5_1 character varying, d6 character varying, d6_1 character varying, d6_2 character varying, d6_3 character varying, d7 character varying, d7_1 character varying, d7_2 character varying, d8 character varying, d8_1 character varying, d8_2 character varying, d8_3 character varying, d9 character varying, d9_1 character varying, d9_2 character varying, d9_3 character varying, d9_4 character varying, d10 character varying, d10_1 character varying, d10_2 character varying, d11 character varying, d11_1 character varying, d11_2 character varying, d11_3 character varying, d12 character varying, d12_1 character varying, d12_2 character varying, d12_3 character varying, d13 character varying, d13_1 character varying, d13_2 character varying, d13_3 character varying, d14 character varying, d14_1 character varying, d14_2 character varying, d14_3 character varying, d14_4 character varying, d14_5 character varying, sys1 character varying, sys2 character varying, f0 character varying, f1 character varying, f2 character varying, f3 character varying, f4 character varying, f4_1 character varying, f4_2 character varying, f5 character varying, f6 character varying, f7 character varying, f8 character varying, f9 character varying, f10 character varying, f11 character varying, f12 character varying, f13 character varying, f13_1 character varying, f13_2 character varying, f13_3 character varying, f13_4 character varying, f13_5 character varying, f14 character varying, f15 character varying, f16 character varying, f17 character varying, recipient_sign_image character varying, sign_name character varying)
 LANGUAGE plpgsql
AS $function$
BEGIN
    RETURN QUERY
select a.pur_ord_master_id::integer as pur_ord_master_id,
		concat('สัญญาเลขที่ ', a.ref_no)::character varying as h1,
		concat(
			'สัญญาฉบับนี้ทำขึ้น ณ ',
			(select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
			' ตำบล/แขวง ',
			(select get_sub_district_name(dcl.language_code,dcl.sub_district_id) from db_company_lang dcl
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' อำเภอ/เขต ',
			(select get_district_name(dcl.language_code,dcl.district_id) from db_company_lang dcl 
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' จังหวัด ',
			(select get_province_name(dcl.language_code,dcl.province_id) from db_company_lang dcl
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' ',
			(select po_format_date_thai('เมื่อวันที่','เดือน','พ.ศ.',a.po_date::date,p_lin_id )),
			' ระหว่าง ',
			(select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
			' โดย ',
			(select signde.emp_name from db_employee_name(p_lin_id) signde where signde.emp_id = a.sign_id),
			' ',
			a.sign_posi,
			' ',
			a.approve_posi,
			' ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้จะซื้อ” ฝ่ายหนึ่ง กับ ',
			case 
				when am.juristic_type = 'Y' -- นิติบุคคล
					then (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),
										' อยู่บ้านเลขที่ ',am.house_no,' ถนน ',am.road ,
										' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
										' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
										' จังหวัด ',get_province_name(p_lin_id,am.province_id),
										' ผู้ถือบัตรประจำตัวประชาชนเลขที่ ',
										am.tax_id,
										' ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้ ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้จะขาย” อีกฝ่ายหนึ่ง'
										))
				else (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),' ซึ่งจดทะเบียนเป็นนิติบุคคล ณ …………………………………………………………………………………… ',
										'มีสำนักงานใหญ่อยู่เลขที่ ',am.house_no,' ถนน ',am.road ,
										' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
										' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
										' จังหวัด ',get_province_name(p_lin_id,am.province_id),
										' โดย ………………………………………………… ผู้มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ………… ลงวันที่ ………………………… (5) (และหนังสือมอบอำนาจลงวันที่ ………………………… ) แนบท้ายสัญญานี้ (6) ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้จะขาย” อีกฝ่ายหนึ่ง'
										))
			end
		)::character varying as h2,
		concat('คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้')::character varying as h3,
		concat('ข้อ 1 ข้อตกลงจะซื้อจะขาย')::character varying as d1,
		concat('ผู้จะซื้อตกลงจะซื้อและผู้จะขายตกลงจะขาย……………………..… (7) ……….….….….………. ตามเอกสารรายการสินค้า และราคาต่อหน่วย เอกสารแนบท้ายสัญญาผนวก 1 ตามจำนวนที่ผู้จะซื้อจะสั่งซื้อเป็นคราวๆ ไป มีกำหนดเวลา…..............(………….......) เดือน ตั้งแต่วันที่ ……… เดือน…………..……….. พ.ศ. ….…. จนถึงวันที่ ……… เดือน…………..….. พ.ศ. ….…. เป็นราคาทั้งสิ้นประมาณ ',
				TO_CHAR(a.total_vat_amt, 'FM999G999G999D00'),' บาท ',' ( ',po_baht_text(a.total_vat_amt::numeric),' )',' ซึ่งได้รวมภาษีมูลค่าเพิ่มตลอดจนภาษีอากรอื่นๆ และค่าใช้จ่ายทั้งปวงด้วยแล้ว')::character varying as d1_1,
		concat('ตลอดอายุสัญญานี้ ผู้จะขายรับจะจัดหาสิ่งของที่จะขายตามวรรคหนึ่งเตรียมส่งมอบไว้ให้แก่ผู้จะซื้อได้อย่างเพียงพอ ตามจำนวนที่คู่สัญญาได้ตกลงประมาณการไว้ในเอกสารแนบท้ายสัญญาผนวก 1 แต่ผู้จะซื้ออาจสั่งซื้อจริงเพิ่มขึ้นหรือลดลงจากจำนวน ประมาณการดังกล่าวก็ได้')::character varying as d1_2,
		concat('ข้อ 2 การรับรองคุณภาพ')::character varying as d2,
		concat('ผู้จะขายรับรองว่าสิ่งของที่จะขายให้ตามสัญญานี้เป็นของแท้ ของใหม่ ไม่เคยใช้งานมาก่อนไม่เป็นของเก่าเก็บ และมีคุณภาพ และคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก……..')::character varying as d2_1,
		concat('ในกรณีที่เป็นการซื้อสิ่งของซึ่งจะต้องมีการตรวจทดลอง ผู้จะขายรับรองว่า เมื่อตรวจทดลองแล้วต้องมีคุณภาพ และคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ด้วย')::character varying as d2_2,
		concat('ข้อ 3 เอกสารอันเป็นส่วนหนึ่งของสัญญา')::character varying as d3,
		concat('เอกสารแนบท้ายสัญญาดังต่อไปนี้ให้ถือเป็นส่วนหนึ่งของสัญญานี้')::character varying as d3_0,
		concat('3.1 ผนวก 1 …...(รายการสินค้าและราคาต่อหน่วย)………....')::character varying as d3_1,
		concat('3.2 ผนวก 2 ……..….(รายการคุณลักษณะเฉพาะ)….....….…...')::character varying as d3_2,
		concat('3.3 ผนวก 3 …………....….(แค็ตตาล็อก) (8)…….......….........')::character varying as d3_3,
		concat('3.4 ผนวก 4 ………………….(แบบรูป) (9)………..….….…….....')::character varying as d3_4,
		concat('3.5 ผนวก 5 ………………..(ใบเสนอราคา)………………..……....')::character varying as d3_5,
		concat('จำนวน......(......) หน้า')::character varying as d3_f1,
		concat('…….…………………………..ฯลฯ.…….…………………………..')::character varying as d3_f2,
		concat('ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความ ในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้จะขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้จะซื้อ คำวินิจฉัยของผู้จะซื้อให้ถือเป็นที่สุด และผู้จะขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้จะซื้อทั้งสิ้น')::character varying as d3_f3,
		concat('ข้อ 4 การออกใบสั่งซื้อแต่ละคราว')::character varying as d4,
		concat('ผู้จะซื้อจะออกใบสั่งซื้อสิ่งของในแต่ละคราวเพียงรายการเดียวหรือหลายรายการ พร้อมกันก็ได้ในปริมาณแต่ละรายการ คราวละอย่างมากไม่เกิน………………….…….……(….…………………………..….)หรืออย่างน้อยไม่ต่ำกว่า………………………..……….…… (………………………………………..….) โดยระบุปริมาณ สถานที่ และวันเวลาที่ผู้จะขายจะต้องส่งมอบไว้ในใบสั่งซื้อแต่ละคราว ทั้งนี้ผู้จะซื้อจะออก ใบสั่งซื้อมอบให้แก่ผู้จะขายล่วงหน้าก่อนครบกำหนดเวลาส่งมอบตามใบสั่งซื้อไม่น้อยกว่า………….………(……………..….) วัน')::character varying as d4_1,
		concat('ข้อ 5 การส่งมอบ')::character varying as d5,
		concat('ผู้จะขายตกลงว่าจะส่งมอบสิ่งของตามสัญญาให้แก่ผู้จะซื้อตามปริมาณ ณ สถานที่ และในวันเวลาที่กำหนดไว้ใน ใบสั่งซื้อแต่ละคราวด้วยค่าใช้จ่ายของผู้จะขายเอง พร้อมทั้งหีบห่อหรือเครื่องรัดพันผูกให้เรียบร้อย')::character varying as d5_1,
		concat('ข้อ 6 การตรวจรับ')::character varying as d6,
		concat('เมื่อผู้จะซื้อได้ตรวจรับสิ่งของที่ส่งมอบและเห็นว่าถูกต้องครบถ้วนตามสัญญาและ ใบสั่งซื้อในแต่ละคราวแล้ว ผู้จะซื้อจะออกหลักฐานการรับมอบเป็นหนังสือไว้ให้ เพื่อผู้จะขายนำมาเป็นหลักฐานประกอบการขอรับเงินค่าสิ่งของนั้น')::character varying as d6_1,
		concat('ถ้าผลของการตรวจรับปรากฏว่า สิ่งของที่ผู้จะขายส่งมอบไม่ตรงตามสัญญาและใบสั่งซื้อผู้จะซื้อทรงไว้ซึ่งสิทธิที่จะ ไม่รับสิ่งของนั้น ในกรณีเช่นนี้ ผู้จะขายต้องรีบนำสิ่งของนั้นกลับคืนโดยเร็วที่สุด  เท่าที่จะทำได้และนำสิ่งของมาส่งมอบให้ใหม่หรือเพิ่มเติม ให้ถูกต้องตามสัญญาและใบสั่งซื้อด้วยค่าใช้จ่ายของ ผู้จะขายเอง และระยะเวลาที่เสียไปดังกล่าว ผู้จะขายจะนำมาอ้างเป็นเหตุขอขยายเวลา ส่งมอบหรือขอลด หรืองดค่าปรับไม่ได้')::character varying as d6_2,
		concat('(10) ในกรณีที่ผู้จะขายส่งมอบสิ่งของถูกต้องแต่ไม่ครบจำนวน หรือส่งมอบครบจำนวน แต่ไม่ถูกต้องทั้งหมด ผู้จะซื้อจะตรวจรับเฉพาะส่วนที่ถูกต้อง โดยออกหลักฐานการตรวจรับเฉพาะส่วนนั้นก็ได้ (ความในวรรคสามนี้ จะไม่กำหนดไว้ในกรณีที่ผู้จะซื้อ ต้องการสิ่งของทั้งหมดในคราวเดียวกัน หรือการซื้อสิ่งของที่ประกอบเป็นชุดหรือหน่วย ถ้าขาดส่วนประกอบอย่างหนึ่งอย่างใดไปแล้ว จะไม่สามารถใช้งานได้โดยสมบูรณ์)')::character varying as d6_3,
		concat('ข้อ 7 การชำระเงิน')::character varying as d7,
		concat('ผู้จะซื้อจะชำระเงินค่าสิ่งของที่คำนวณตามปริมาณที่กำหนดในใบสั่งซื้อแต่ละคราว และตามราคาต่อหน่วยดังระบุไว้ ในเอกสารแนบท้ายสัญญาผนวก 1 ให้แก่ผู้จะขายภายใน..…..…….(……..….) วัน  นับถัดจากวันที่ผู้จะขายได้แสดงหลักฐานการรับมอบตามข้อ 6 ให้แก่ผู้จะซื้อ')::character varying as d7_1,
		concat('(11) การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้จะซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของ ผู้จะขาย ชื่อธนาคาร……………….…….…………....สาขา……………………………..……..ชื่อบัญชี……………………………..เลขที่บัญชี……………….……..…………….. ทั้งนี้ ผู้จะขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายใดๆ (ถ้ามี) ที่ธนาคารเรียกเก็บ และยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้นๆ (ความในวรรคนี้ใช้สำหรับกรณีที่หน่วยงานของรัฐจะจ่ายเงินตรง ให้แก่ผู้จะขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้จะขาย ตามแนวทางที่กระทรวงการคลังหรือ หน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนด แล้วแต่กรณี)')::character varying as d7_2,
		concat('ข้อ 8 การรับประกันความชำรุดบกพร่อง')::character varying as d8,
		concat('ผู้จะขายตกลงรับประกันความชำรุดบกพร่องหรือขัดข้องของสิ่งของตามสัญญานี้ เป็นเวลา…….(12).……(…….…...……...) ปี …...…..…..(…….……....…..) เดือน นับถัดจากวันที่ผู้จะซื้อได้รับมอบโดยภายในกำหนดเวลาดังกล่าวหากสิ่งของตามสัญญานี้เกิดชำรุดบกพร่อง หรือขัดข้องอันเนื่องมาจาก การใช้งานตามปกติ ผู้จะขายจะต้องจัดการซ่อมแซมหรือแก้ไขให้อยู่ในสภาพที่ใช้การได้ดีดังเดิม ',
				' ภายใน ',a.complete_day,' ''( ',po_qty_text(a.complete_day::numeric),' )',' ','วัน',
				'นับถัดจากวันที่ได้รับแจ้งจากผู้จะซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ ทั้งสิ้น หากผู้จะขายไม่จัดการซ่อมแซมหรือแก้ไขภายในกำหนด เวลาดังกล่าว ผู้จะซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นให้ทำการนั้นแทนผู้จะขาย โดยผู้จะขายต้องเป็นผู้ออกค่าใช้จ่ายเองทั้งสิ้น')::character varying as d8_1,
		concat('ในกรณีเร่งด่วนจำเป็นต้องรีบแก้ไขเหตุชำรุดบกพร่องหรือขัดข้องโดยเร็ว และไม่อาจรอคอยให้ผู้จะขายแก้ไข ในระยะเวลาที่กำหนดไว้ตามวรรคหนึ่งได้ ผู้จะซื้อมีสิทธิเข้าจัดการแก้ไขเหตุชำรุดบกพร่องหรือขัดข้องนั้นเอง หรือให้ผู้อื่นแก้ไขความชำรุด บกพร่องหรือขัดข้อง โดยผู้จะขายต้องรับผิดชอบชำระค่าใช้จ่ายทั้งหมด')::character varying as d8_2,
		concat('การที่ผู้จะซื้อทำการนั้นเอง หรือให้ผู้อื่นทำการนั้นแทนผู้จะขาย ไม่ทำให้ผู้จะขาย หลุดพ้นจากความรับผิดตามสัญญา หากผู้จะขายไม่ชดใช้ค่าใช้จ่ายหรือค่าเสียหายตามที่ผู้จะซื้อเรียกร้อง ผู้จะซื้อมีสิทธิบังคับจากหลักประกันการปฏิบัติตามสัญญาได้')::character varying as d8_3,
		concat('ข้อ 9 หลักประกันการปฏิบัติตามสัญญา')::character varying as d9,
		concat('ในขณะทำสัญญานี้ผู้จะขายได้นำหลักประกันเป็น',(select string_agg(concat(pgtl.guaranty_type_name, ' เป็นจำนวนเงิน ' ,TO_CHAR(pgm.collateral_amt, 'FM999G999G999D00'), ' บาท ','( ', po_baht_text(pgm.collateral_amt::numeric), ' ) '),', ')
											from po_guaranty_master pgm 
											left join po_guaranty_detail pgd on pgm.guaranty_master_id = pgd.guaranty_master_id 
											left join po_guaranty_type pgt on pgd.guaranty_type = pgt.guaranty_type_code 
													left join po_guaranty_type_lang pgtl on pgt.guaranty_type_id = pgtl.guaranty_type_id 
															and lower(pgtl.language_code) = lower(p_lin_id)
											where pgm.status <> 'C' and pgm.ref_doc_type = a.doc_type and pgm.ref_doc_no = a.po_no),
				'ซึ่งเท่ากับร้อยละ..……(14)….…(…………..……….…...) ของราคาทั้งหมดตามสัญญามามอบให้แก่ผู้จะซื้อเพื่อเป็นหลักประกัน การปฏิบัติตามสัญญานี้')::character varying as d9_1,
		concat('(15) กรณีผู้จะขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญาหนังสือค้ำประกันดังกล่าวจะต้องออก โดยธนาคารที่ประกอบกิจการในประเทศไทยหรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุนเพื่อ การพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทยตามรายชื่อบริษัทเงินทุนที่ ธนาคารแห่งประเทศไทย แจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนดหรืออาจเป็นหนังสือค้ำประกัน อิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้และจะต้องมีอายุการค้ำประกันตลอดไปจนกว่าผู้จะขายพ้น ข้อผูกพันตามสัญญานี้')::character varying as d9_2,
		concat('หลักประกันที่ผู้จะขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิด ทั้งปวงของผู้จะขาย ตลอดอายุสัญญา ถ้าหลักประกันที่ผู้จะขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง หรือมีอายุไม่ครอบคลุมถึงความรับผิดของผู้จะขาย ตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณี ผู้จะขายส่งมอบสิ่งของล่าช้าเป็นเหตุให้ระยะเวลาส่งมอบหรือวันครบกำหนด ความรับผิดในความชำรุดบกพร่องตามสัญญาเปลี่ยนแปลงไปไม่ว่าจะเกิดขึ้นคราวใด ผู้จะขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติม ให้มีจำนวนครบถ้วนตามวรรคหนึ่งมามอบให้แก่ ผู้จะซื้อภายใน..............(...…….….) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้จะซื้อ')::character varying as d9_3,
		concat('หลักประกันที่ผู้จะขายนำมามอบไว้ตามข้อนี้ ผู้จะซื้อจะคืนให้แก่ผู้จะขายโดยไม่มีดอกเบี้ยเมื่อผู้จะขายพ้นจากข้อผูกพัน และความรับผิดทั้งปวงตามสัญญานี้แล้ว')::character varying as d9_4,
		concat('ข้อ 10 การบอกเลิกสัญญา')::character varying as d10,
		concat('ถ้าผู้จะขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่ง หรือเมื่อครบกำหนดส่งมอบสิ่งของ ตามใบสั่งซื้อ หากผู้จะขายไม่ส่งมอบ สิ่งของที่ตกลงจะขายให้แก่ผู้จะซื้อหรือส่งมอบไม่ถูกต้องหรือไม่ครบจำนวน ผู้จะซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้ การใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบสิทธิของ ผู้จะซื้อที่จะเรียกร้องค่าเสียหายจากผู้จะขาย')::character varying as d10_1,
		concat('ในกรณีที่ผู้จะซื้อใช้สิทธิบอกเลิกสัญญา ผู้จะซื้อมีสิทธิริบหรือบังคับจากหลักประกัน ตามข้อ 9 เป็นจำนวนเงินทั้งหมด หรือแต่บางส่วนก็ได้ แล้วแต่ผู้จะซื้อจะเห็นสมควร และถ้าผู้จะซื้อ จัดซื้อสิ่งของจากบุคคลอื่นเต็มจำนวนหรือเฉพาะจำนวนที่ขาดส่งแล้วแต่กรณี ภายในกำหนด…(16).…(….……………..) เดือน นับถัดจากวันบอกเลิกสัญญา ผู้จะขายจะต้องชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ ในสัญญานี้ด้วย')::character varying as d10_2,
		concat('ข้อ 11 ค่าปรับ')::character varying as d11,
		concat('ในกรณีที่ผู้จะซื้อไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ 10 ผู้จะขายจะต้องชำระค่าปรับให้ ผู้จะซื้อเป็นรายวัน ในอัตราร้อยละ ',
				TO_CHAR(a.fine_rate::numeric, 'FM999G999G999D00')::numeric,
				' ( ',po_read_number_digit_text(a.fine_rate),' )',
				' ของราคาสิ่งของที่ยังไม่ได้รับมอบ  นับถัดจากวันครบกำหนดส่งมอบตามใบสั่งซื้อจนถึงวันที่ ผู้จะขายได้นำสิ่งของมาส่งมอบให้แก่ผู้จะซื้อจนถูกต้องครบถ้วนตามใบสั่งซื้อ หรือจนถึงวันที่ผู้จะซื้อได้ซื้อสิ่งของตามใบสั่งซื้อนั้นจากบุคคลอื่น ในกรณีนี้ผู้จะขาย ยอมรับผิดชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญาด้วย ซึ่งผู้จะขายตกลงให้ผู้จะซื้อหักเงินค่าปรับและราคา ที่เพิ่มขึ้นดังกล่าวจากราคาสิ่งของที่จะต้องชำระตามใบสั่งซื้อคราวใดก็ได้ หรือให้ผู้จะซื้อเรียกร้องจากผู้จะขายตามข้อ 12 หรือจะบังคับจาก หลักประกันการปฏิบัติตามสัญญาตามข้อ 9 ก็ได้ ตามที่ผู้จะซื้อ จะเห็นสมควร')::character varying as d11_1,
		concat('การคิดค่าปรับในกรณีสิ่งของที่ตกลงจะซื้อจะขายประกอบกันเป็นชุด แต่ผู้จะขายส่งมอบเพียงบางส่วนหรือขาด ส่วนประกอบส่วนหนึ่งส่วนใดไป ทำให้ไม่สามารถใช้การได้โดยสมบูรณ์ ให้ถือว่ายังไม่ได้ส่งมอบสิ่งของนั้นเลย และให้คิดค่าปรับจากราคา สิ่งของเต็มทั้งชุด')::character varying as d11_2,
		concat('ในระหว่างที่ผู้จะซื้อยังมิได้ใช้สิทธิบอกเลิกสัญญานั้น หากผู้จะซื้อเห็นว่าผู้จะขายไม่อาจ ปฏิบัติตามสัญญาต่อไปได้ ผู้จะซื้อจะใช้สิทธิบอกเลิกสัญญา และริบหรือบังคับจากหลักประกันการปฏิบัติ ตามสัญญาตามข้อ 9 กับเรียกร้องให้ชดใช้ราคาที่เพิ่มขึ้น ตามที่กำหนดไว้ในข้อ 10 วรรคสอง ก็ได้ และถ้าผู้จะซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยังผู้จะขายเมื่อครบกำหนดส่งมอบตามใบสั่งซื้อ แล้วผู้จะซื้อมีสิทธิที่จะปรับผู้จะขายจนถึงวันบอกเลิกสัญญาได้อีกด้วย')::character varying as d11_3,
		concat('ข้อ 12 การบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย')::character varying as d12,
		concat('ในกรณีที่ผู้จะขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุ ให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้จะซื้อ ผู้จะขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้จะซื้อโดยสิ้นเชิงภายในกำหนด.................... (.....................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้จะซื้อ หากผู้จะขายไม่ชดใช้ให้ถูกต้องครบถ้วนภายในระยะเวลาดังกล่าว ให้ผู้จะซื้อมีสิทธิที่จะหักเอาจากจำนวนเงินค่าสิ่งของที่จะซื้อจะขายที่ต้องชำระ หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที')::character varying as d12_1,
		concat('หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากเงินค่าสิ่งของที่จะซื้อจะขายที่ต้องชำระ หรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้จะขายยินยอมชำระส่วนที่เหลือที่ยังขาดอยู่ จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด......................(........................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้จะซื้อ')::character varying as d12_2,
		concat('หากมีเงินค่าสิ่งของที่จะซื้อจะขายตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้จะซื้อจะคืนให้แก่ผู้จะขายทั้งหมด')::character varying as d12_3,
		concat('ข้อ 13 การงดหรือลดค่าปรับ หรือขยายเวลาส่งมอบ')::character varying as d13,
		concat('ในกรณีที่มีเหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้จะซื้อ หรือเหตุสุดวิสัย หรือเกิดจากพฤติการณ์อันหนึ่งอันใด ที่ผู้จะขายไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนด ในกฎกระทรวง ซึ่งออกตามความในกฎหมายว่าด้วยการจัดซื้อจัดจ้าง และการบริหารพัสดุภาครัฐ ทำให้ ผู้จะขายไม่สามารถส่งมอบสิ่งของตามเงื่อนไขและกำหนดเวลาแห่งสัญญานี้ได้ ผู้จะขายมีสิทธิของดหรือ ลดค่าปรับหรือขยายเวลาส่งมอบตามสัญญาได้ โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐาน เป็นหนังสือให้ผู้จะซื้อทราบภายใน ๑๕ (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนด ในกฎกระทรวงดังกล่าว')::character varying as d13_1,
		concat('ถ้าผู้จะขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้จะขายได้สละสิทธิเรียกร้องในการที่จะของดหรือลด ค่าปรับหรือขยายเวลาส่งมอบตามสัญญา โดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณีเหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้จะซื้อซึ่ง มีหลักฐานชัดแจ้งหรือผู้จะซื้อทราบดีอยู่แล้วตั้งแต่ต้น')::character varying as d13_2,
		concat('การงดหรือลดค่าปรับหรือขยายเวลาส่งมอบตามสัญญาตามวรรคหนึ่งอยู่ในดุลพินิจของผู้จะซื้อที่จะพิจารณาตาม ที่เห็นสมควร')::character varying as d13_3,
		concat('ข้อ 14 การใช้เรือไทย')::character varying as d14,
		concat('ถ้าสิ่งของที่จะต้องส่งมอบให้ผู้จะซื้อตามสัญญานี้เป็นสิ่งของที่ผู้จะขายจะต้องสั่ง หรือนำเข้ามาจากต่างประเทศ และสิ่งของ นั้นต้องนำเข้ามาโดยทางเรือในเส้นทางเดินเรือที่มีเรือไทยเดินอยู่และสามารถให้บริการรับขนได้ตามที่รัฐมนตรี ว่าการกระทรวงคมนาคมประกาศกำหนดผู้จะขายต้องจัดการให้สิ่งของดังกล่าวบรรทุกโดยเรือไทย หรือเรือที่มีสิทธิเช่นเดียวกับเรือไทย จากต่างประเทศมายัง ประเทศไทยเว้นแต่จะได้รับอนุญาตจากกรมเจ้าท่าก่อนบรรทุกของนั้นลงเรืออื่นที่มิใช่เรือไทยหรือเป็นของที่ รัฐมนตรีว่าการกระทรวงคมนาคมประกาศ ยกเว้นให้บรรทุกโดย เรืออื่นได้ ทั้งนี้ไม่ว่าการสั่งหรือนำเข้าสิ่งของดังกล่าว จากต่างประเทศเป็นแบบใด')::character varying as d14_1,
		concat('ในการส่งมอบสิ่งของตามสัญญาให้แก่ผู้จะซื้อ ถ้าสิ่งของนั้นเป็นสิ่งของตามวรรคหนึ่ง ผู้จะขายจะต้องส่งมอบใบตราส่ง (Bill of Lading) หรือสำเนาใบตราส่งสำหรับของนั้น ซึ่งแสดงว่าได้บรรทุกมาโดยเรือไทยหรือเรือที่มีสิทธิเช่นเดียวกับเรือไทยให้แก่ผู้จะซื้อ พร้อมกับการส่งมอบสิ่งของด้วย')::character varying as d14_2,
		concat('ในกรณีที่สิ่งของดังกล่าวไม่ได้บรรทุกจากต่างประเทศมายังประเทศไทยโดยเรือไทย หรือเรือที่มีสิทธิเช่นเดียวกับเรือไทย ผู้จะขายต้องส่งมอบหลักฐานซึ่งแสดงว่าได้รับอนุญาตจากกรมเจ้าท่า ให้บรรทุกของโดยเรืออื่นได้หรือหลักฐานซึ่งแสดงว่าได้ชำระค่าธรรมเนียม พิเศษเนื่องจากการไม่บรรทุกของ โดยเรือไทยตามกฎหมายว่าด้วยการส่งเสริมการพาณิชยนาวีแล้วอย่างใดอย่างหนึ่งแก่ผู้จะซื้อด้วย')::character varying as d14_3,
		concat('ในกรณีที่ผู้จะขายไม่ส่งมอบหลักฐานอย่างใดอย่างหนึ่งดังกล่าวในวรรคสองและ วรรคสามให้แก่ผู้จะซื้อแต่จะขอส่งมอบ สิ่งของดังกล่าวให้ผู้จะซื้อก่อนโดยยังไม่รับชำระเงินค่าสิ่งของ ผู้จะซื้อ มีสิทธิรับสิ่งของดังกล่าวไว้ก่อนและชำระเงินค่าสิ่งของเมื่อผู้จะขาย ได้ปฏิบัติถูกต้องครบถ้วนดังกล่าวแล้วได้')::character varying as d14_4,
		concat('สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยานและคู่สัญญาต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ')::character varying as d14_5,
		concat('(ลงชื่อ) ',deapprove.emp_name,' ผู้ซื้อ')::character varying as sys1,
		concat('( ',a.sign_posi,' ',a.approve_posi,' )')::character varying as sys2,
		concat('วิธีปฏิบัติเกี่ยวกับสัญญาจะซื้อจะขายแบบราคาคงที่ไม่จำกัดปริมาณ')::character varying as f0,
		concat('(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ')::character varying as f1,
		concat('(2) ให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น')::character varying as f2,
		concat('(3) ให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับมอบอำนาจเช่น นาย ก. อธิบดีกรม……………… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………………..')::character varying as f3,
		concat('(4) ให้ระบุชื่อผู้จะขาย')::character varying as f4,
		concat('ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด')::character varying as f4_1,
		concat('ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่')::character varying as f4_2,
		concat('(5) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f5,
		concat('(6) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f6,
		concat('(7) ให้ระบุว่าเป็นการจะซื้อจะขายสิ่งของตามตัวอย่าง หรือรายการละเอียด หรือแค็ตตาล็อกหรือแบบรูปรายการ หรืออื่น ๆ (ให้ระบุ)')::character varying as f7,
		concat('(8) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f8,
		concat('(9) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f9,
		concat('(10) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f10,
		concat('(11) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f11,
		concat('(12) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะของสิ่งของที่จะซื้อจะขายกัน โดยให้อยู่ในดุลพินิจของผู้จะซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารเชิญชวนด้วย')::character varying as f12,
		concat('(13) “หลักประกัน” หมายถึง หลักประกันที่ผู้จะขายนำมามอบไว้แก่หน่วยงานของรัฐ เมื่อลงนาม ในสัญญา เพื่อเป็นการประกันความเสียหายที่อาจจะเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้')::character varying as f13,
		concat('(1) เงินสด')::character varying as f13_1,
		concat('(2) เช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน ๓ วันทำการ')::character varying as f13_2,
		concat('(3) หนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนด  โดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้')::character varying as f13_3,
		concat('(4) หนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบกิจการเงินทุน เพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทยตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทย แจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือ ค้ำประกันของธนาคารที่คณะกรรมการนโยบายกําหนด')::character varying as f13_4,
		concat('(5) พันธบัตรรัฐบาลไทย')::character varying as f13_5,
		concat('(14) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลัง ว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๘')::character varying as f14,
		concat('(15) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออก ได้ตามข้อเท็จจริง')::character varying as f15,
		concat('(16) กำหนดเวลาที่ผู้จะซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงิน ในส่วนที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้จะซื้อโดยตกลงกับผู้จะขาย และโดยปกติแล้วไม่ควรเกิน ๓ เดือน')::character varying as f16,
		concat('(17) อัตราค่าปรับตามสัญญาข้อ ๑๑ ให้กำหนดเป็นรายวันในอัตราระหว่างร้อยละ ๐.๑๐-๐.๒๐ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. ๒๕๖๐ ข้อ ๑๖๒ ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของรัฐผู้จะซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่จะซื้อจะขาย ซึ่งอาจมีผลกระทบต่อการที่ผู้จะขายจะหลีกเลี่ยงไม่ปฏิบัติตามสัญญา แต่ทั้งนี้การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใด จะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย')::character varying as f17,
		case when deapprove.personal_id is not null and deapprove.signature_image_id is not null
			then concat((select sp.parameter_value  from su_parameter sp 
							where sp.parameter_group_code = 'ContentPath'
							and sp.parameter_code = 'SignatureURL')
							,'?PersonalId=',deapprove.personal_id,'&ContentId=',deapprove.signature_image_id)
			else null end::character varying as recipient_sign_image,
		deapprove.emp_name::character varying AS sign_name
from po_pur_ord_master a 
left join ap_member am on a.ap_member_id = am.ap_member_id 
		left join ap_member_lang aml on aml.ap_member_id = am.ap_member_id and lower(aml.language_code) = lower(p_lin_id)
		left join db_prefix_lang aml2 on aml2.prefix_id = aml.prefix_id 
				and lower(aml2.language_code) = lower(p_lin_id)
left join db_employee_name(p_lin_id) deapprove on deapprove.emp_id = a.sign_id
where a.pur_ord_master_id = p_pur_ord_master_id;
    END;
$function$
;
