drop function report_pood18;--get full_name ap_member report_pood18

CREATE OR REPLACE FUNCTION erp.report_pood18(p_lin_id character varying, p_pur_ord_master_id integer)
 RETURNS TABLE(pur_ord_master_id integer, program_header character varying, program_name character varying, h1 character varying, h2 character varying, h3 character varying, d1 character varying, d1_1 character varying, d2 character varying, d2_0 character varying, d2_1 character varying, d2_2 character varying, d2_3 character varying, d2_f1_1 character varying, d2_f1_2 character varying, d2_f1_3 character varying, d2_f2 character varying, d2_f3 character varying, d3 character varying, d3_1 character varying, d4 character varying, d4_0 character varying, d4_1 character varying, d4_2 character varying, d4_3 character varying, d4_f1 character varying, d4_f2 character varying, d4_f3 character varying, d5 character varying, d5_1 character varying, d5_2 character varying, d5_3 character varying, d5_4 character varying, d6 character varying, d6_1 character varying, d6_2 character varying, d6_3 character varying, d6_4 character varying, d7 character varying, d7_1 character varying, d7_2 character varying, d7_3 character varying, d8 character varying, d8_1 character varying, d8_2 character varying, d8_3 character varying, d8_4 character varying, d9 character varying, d9_1 character varying, d9_2 character varying, d10 character varying, d10_1 character varying, d10_2 character varying, d10_3 character varying, d11 character varying, d11_1 character varying, d11_2 character varying, d11_3 character varying, d12 character varying, d12_1 character varying, d12_2 character varying, d12_3 character varying, d12_4 character varying, sys1 character varying, sys2 character varying, sys3 character varying, sys4 character varying, sys5 character varying, sys6 character varying, sys7 character varying, sys8 character varying, f0 character varying, f1 character varying, f2 character varying, f3 character varying, f4 character varying, f4_1 character varying, f4_2 character varying, f5 character varying, f6 character varying, f7 character varying, f8 character varying, f9 character varying, f9_1 character varying, f9_2 character varying, f9_3 character varying, f9_4 character varying, f9_5 character varying, f10 character varying, f11 character varying, f12 character varying, recipient_sign_image character varying, sign_name character varying)
 LANGUAGE plpgsql
AS $function$
BEGIN
    RETURN QUERY
    select a.pur_ord_master_id::integer as pur_ord_master_id,
            concat('แบบสัญญา')::character varying as program_header,
            concat('สัญญาจ้างบริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์')::character varying as program_name,
            concat('สัญญาเลขที่ ', a.ref_no)::character varying as h1,
            concat(
                'สัญญาฉบับนี้ทำขึ้น ณ ',
                (select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
                ' ตำบล/แขวง ',
                (select get_sub_district_name(dcl.language_code,dcl.sub_district_id) from db_company_lang dcl
                where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
                ' อำเภอ/เขต ',
                (select get_district_name(dcl.language_code,dcl.district_id) from db_company_lang dcl 
                where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
                ' จังหวัด ',
                (select get_province_name(dcl.language_code,dcl.province_id) from db_company_lang dcl
                where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
                ' ',
                (select po_format_date_thai('เมื่อวันที่','เดือน','พ.ศ.',a.po_date::date,p_lin_id )),
                ' ระหว่าง ',
                (select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
                ' โดย ',
                (select signde.emp_name from db_employee_name(p_lin_id) signde where signde.emp_id = a.sign_id),
                ' ',
                a.sign_posi,
                ' ',
                a.approve_posi,
                ' ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ว่าจ้าง” ฝ่ายหนึ่ง กับ ',
                case 
                    when am.juristic_type = 'Y' -- นิติบุคคล
                        then (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),
                                            ' อยู่บ้านเลขที่ ',am.house_no,' ถนน ',am.road ,
                                            ' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
                                            ' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
                                            ' จังหวัด ',get_province_name(p_lin_id,am.province_id),
                                            ' ผู้ถือบัตรประจำตัวประชาชนเลขที่ ',
                                            am.tax_id,
                                            ' ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้ ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้รับจ้าง” อีกฝ่ายหนึ่ง'
                                            ))
                    else (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),' ซึ่งจดทะเบียนเป็นนิติบุคคล ณ …………………………………………………………………………………… ',
                                            'มีสำนักงานใหญ่อยู่เลขที่ ',am.house_no,' ถนน ',am.road ,
                                            ' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
                                            ' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
                                            ' จังหวัด ',get_province_name(p_lin_id,am.province_id),
                                            ' โดย ………………………………………………… ผู้มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ………… ลงวันที่ ………………………… (5) (และหนังสือมอบอำนาจลงวันที่ ………………………… ) แนบท้ายสัญญานี้ (6) ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้รับจ้าง” อีกฝ่ายหนึ่ง'
                                            ))
                end
                )::character varying as h2,
            concat('คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้')::character varying as h3,
            concat('ข้อ 1 ขอบเขตของงาน')::character varying as d1,
            concat('ผู้ว่าจ้างตกลงจ้างและผู้รับจ้างตกลงรับจ้างให้บริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ อุปกรณ์การประมวลผล และระบบคอมพิวเตอร์ ตามเอกสารแนบท้ายสัญญาผนวก ๑ ซึ่งต่อไป ในสัญญานี้เรียกว่า “คอมพิวเตอร์” ซึ่งติดตั้งอยู่ ณ ',a.rec_place,
                    ' ผู้รับจ้างจะจัดหาวัสดุสิ่งของชนิดที่ดีได้มาตรฐาน ใช้เครื่องมือดี และช่างผู้ชำนาญและฝีมือดี เพื่อใช้ในงานจ้างที่จำเป็นสำหรับการปฏิบัติงานตามสัญญา')::character varying as d1_1,
            concat('ข้อ 2 เอกสารอันเป็นส่วนหนึ่งของสัญญา')::character varying as d2,
            concat('เอกสารแนบท้ายสัญญาดังต่อไปนี้ให้ถือว่าเป็นส่วนหนึ่งของสัญญานี้')::character varying as d2_0,
            concat('2.1 ผนวก 1 รายการคอมพิวเตอร์ที่บำรุงรักษาตามสัญญา')::character varying as d2_1,
            concat('2.2 ผนวก 2 การกำหนดตัวถ่วงของคอมพิวเตอร์')::character varying as d2_2,
            concat('2.3 ผนวก 3 คาบเวลาที่ต้องการบำรุงรักษาและอัตราค่าบำรุงรักษา')::character varying as d2_3,
            concat('จำนวน......(......) หน้า')::character varying as d2_f1_1,
            concat('จำนวน......(......) หน้า')::character varying as d2_f1_2,
            concat('จำนวน......(......) หน้า')::character varying as d2_f1_3,
            concat('…….…………………………..ฯลฯ.…….…………………………..')::character varying as d2_f2,
            concat('ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความ ในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้รับจ้างจะต้องปฏิบัติตามคำวินิจฉัยของ ผู้ว่าจ้าง คำวินิจฉัยของผู้ว่าจ้างให้ถือเป็นที่สุด และผู้รับจ้างไม่มีสิทธิเรียกร้องค่าจ้าง ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้ว่าจ้างทั้งสิ้น')::character varying as d2_f3,
            concat('ข้อ 3 ระยะเวลาให้บริการ')::character varying as d3,
            concat('ผู้รับจ้างตกลงให้บริการตามสัญญานี้ ตั้งแต่วันที่ …….... เดือน …………...……..... พ.ศ. ………… ถึงวันที่……. เดือน………………… พ.ศ. …… รวมเป็นเวลาทั้งสิ้น ...…...(….....) ปี ….….(……….) เดือน ...…...(….…) วัน')::character varying as d3_1,
            concat('ข้อ 4 ค่าจ้างและการจ่ายเงิน')::character varying as d4,
            concat('ผู้ว่าจ้างตกลงชำระค่าจ้างบริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์เป็นเงิน ทั้งสิ้น ', TO_CHAR(a.gs_aft_disc, 'FM999G999G999D00'),' บาท ',' ( ',po_baht_text(a.gs_aft_disc::numeric),' ) ',
                    'ซึ่งได้รวมภาษีมูลค่าเพิ่มจำนวน ',TO_CHAR(a.total_vat_amt, 'FM999G999G999D00'),' บาท ',' ( ',po_baht_text(a.total_vat_amt::numeric),' ) ',
                    'ตลอดจนค่าแรงงานค่าสิ่งของตลอดอายุสัญญา ภาษีอากรอื่น และค่าใช้จ่ายทั้งปวงไว้ด้วยแล้ว โดยผู้ว่าจ้างจะ แบ่งจ่ายให้แก่ผู้รับจ้างเป็นงวดๆ รวม…..…..….(………..…) งวด ดังนี้')::character varying as d4_0,
            concat('งวดที่ 1 เป็นเงิน…………….....….บาท (…………........………...…………) จะจ่ายเมื่อผู้รับจ้าง ได้ดำเนินการบำรุงรักษาและ ซ่อมแซมแก้ไขคอมพิวเตอร์เป็นเวลา……………….…………..(.................................) เดือน และผู้ว่าจ้างได้ตรวจรับมอบงานตามสัญญาแล้ว')::character varying as d4_1,
            concat('งวดที่ 2 เป็นเงิน…………….....….บาท (……….…....…………...…………) จะจ่ายเมื่อผู้รับจ้าง ได้ดำเนินการบำรุงรักษาและ ซ่อมแซมแก้ไขคอมพิวเตอร์เป็นเวลา………...…….…….…..(................................) เดือน และผู้ว่าจ้างได้ตรวจรับมอบงานตามสัญญาแล้ว')::character varying as d4_2,
            concat('งวดที่ 3 เป็นเงิน………….........….บาท (…………............…...…………) จะจ่ายเมื่อผู้รับจ้าง ได้ดำเนินการบำรุงรักษาและ ซ่อมแซมแก้ไขคอมพิวเตอร์เป็นเวลา………...…………..…..(...............................) เดือน และผู้ว่าจ้างได้ตรวจรับมอบงานตามสัญญาแล้ว')::character varying as d4_3,
            concat('…….…………………………..ฯลฯ.…….…………………………..')::character varying as d4_f1,
            concat('ค่าจ้างตามสัญญานี้ เป็นอัตราที่กำหนดไว้สำหรับการให้บริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ในเวลา ตามรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก 3')::character varying as d4_f2,
            concat('ในกรณีที่มีการเปลี่ยนแปลงรายการตามเอกสารแนบท้ายสัญญาผนวก 3 หรือมีการเปลี่ยนแปลงลักษณะเฉพาะ ของคอมพิวเตอร์ส่วนใดส่วนหนึ่งอันเป็นผลให้ต้องมีการเปลี่ยนแปลงแก้ไขอัตราค่าจ้างบริการบำรุงรักษาและซ่อมแซมแก้ไขตามที่ระบุไว้ในเอกสารแนบท้ายสัญญาผนวก 3 ผู้ว่าจ้างหรือผู้รับจ้างมีสิทธิขอเปลี่ยนแปลงแก้ไขอัตราค่าจ้างบริการดังกล่าวได้การเปลี่ยนแปลงแก้ไขอัตราค่าจ้าง บริการดังกล่าวจะมีผลบังคับต่อเมื่อได้ระบุไว้ในผนวกเพิ่มเติม ซึ่งจะถือว่าเป็นส่วนหนึ่งแห่งสัญญานี้')::character varying as d4_f3,
            concat('ข้อ 5 การรับประกันผลงาน')::character varying as d5,
            concat('ผู้รับจ้างตกลงบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ตามสัญญานี้ให้อยู่ในสภาพใช้งานได้ดีอยู่เสมอ โดยให้มีเวลาคอมพิวเตอร์ขัดข้องรวมตามเกณฑ์การคำนวณเวลาขัดข้อง ไม่เกินเดือนละ………..….……(………………...) ชั่วโมง หรือร้อยละ………….….(…..……..………) ของเวลาใช้งานทั้งหมดของคอมพิวเตอร์ของเดือนนั้น แล้วแต่ตัวเลขใดจะมากกว่ากัน มิฉะนั้นผู้รับจ้างต้องยอมให้ผู้ว่าจ้างคิดค่าปรับเป็นรายชั่วโมง ในอัตราชั่วโมงละ................(7)...............บาท (.....................................) ในช่วงเวลาที่ไม่สามารถใช้คอมพิวเตอร์ได้ในส่วนที่เกินกว่ากำหนดเวลาขัดข้องข้างต้น')::character varying as d5_1,
            concat('เกณฑ์การคำนวณเวลาขัดข้องของคอมพิวเตอร์ตามวรรคหนึ่งให้เป็นไปดังนี้')::character varying as d5_2,
            concat('- กรณีที่คอมพิวเตอร์เกิดขัดข้องพร้อมกันหลายหน่วย ให้นับเวลาขัดข้องของหน่วยที่มี ตัวถ่วงมากที่สุดเพียงหน่วยเดียว')::character varying as d5_3,
            concat('- กรณีความเสียหายอันสืบเนื่องมาจากความขัดข้องของคอมพิวเตอร์แตกต่างกันเวลาที่ใช้ในการคำนวณค่าปรับ จะเท่ากับเวลาขัดข้องของคอมพิวเตอร์หน่วยนั้นคูณด้วยตัวถ่วงซึ่งมีค่าต่างๆ ตามเอกสาร แนบท้ายสัญญาผนวก 2')::character varying as d5_4,
            concat('ข้อ 6 การให้บริการ')::character varying as d6,
            concat('ผู้รับจ้างตกลงว่า การบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ให้รวมถึงการบำรุงรักษา เพื่อป้องกันความชำรุดเสียหาย ของคอมพิวเตอร์ตลอดระยะเวลาตามสัญญานี้ โดยจะทำการซ่อมแซมแก้ไขและเปลี่ยนสิ่งที่จำเป็นทุกประการเพื่อให้คอมพิวเตอร์อยู่ในสภาพ ใช้งานได้ดีตามปกติโดยไม่คิดค่าใช้จ่ายใดๆ เพิ่มเติมนอกเหนือจากค่าจ้างตามข้อ 4 แห่งสัญญานี้')::character varying as d6_1,
            concat('ผู้รับจ้างจะต้องจัดให้ช่างผู้มีความรู้ความชำนาญและฝีมือดีมาตรวจสอบบำรุงรักษาคอมพิวเตอร์อย่างน้อย เดือนละ...............….(……….…..………) ครั้ง ในกรณีคอมพิวเตอร์ขัดข้องใช้การไม่ได้ตามปกติ ผู้รับจ้างจะต้องจัดการซ่อมแซมแก้ไขให้อยู่ใน สภาพใช้การได้ดีดังเดิม โดยต้องเริ่มจัดการซ่อมแซมแก้ไขภายใน ',
					a.complete_day,' '
					'( ',po_qty_text(a.complete_day::numeric),' )',
					' ',' วัน/ชั่วโมง นับตั้งแต่เวลาที่ได้รับแจ้ง จากผู้ว่าจ้างหรือผู้ที่ได้รับมอบหมายจากผู้ว่าจ้างโดยจะแจ้งให้ผู้รับจ้างหรือผู้ที่ได้รับมอบหมายจากผู้รับจ้างทราบ ทางวาจา ทางโทรสาร หรือทางไปรษณีย์อิเล็กทรอนิกส์  (e-mail) หรือทางโทรศัพท์ ไม่ว่าวิธีใดวิธีหนึ่งให้ถือเป็นการแจ้งโดยชอบ ตามสัญญานี้แล้ว และผู้รับจ้างจะต้องซ่อมแซมแก้ไข หรือเปลี่ยนสิ่งที่จำเป็นให้เสร็จเรียบร้อยภายใน',
					a.complete_day,' '
					'( ',po_qty_text(a.complete_day::numeric),' )',
					' ',' วัน/ชั่วโมง นับแต่เวลาที่ได้รับแจ้ง จากผู้ว่าจ้างดังกล่าว')::character varying as d6_2,
            concat('ในกรณีที่ผู้รับจ้างไม่เข้ามาซ่อมแซมแก้ไขภายในเวลาที่กำหนด หรือไม่สามารถดำเนินการซ่อมแซมแก้ไขหรือไม่สามารถ จัดหาอุปกรณ์ใหม่ที่มีคุณสมบัติทัดเทียมกันหรือดีกว่ามาเปลี่ยนให้ใช้งานได้ ภายในเวลา ที่กำหนดไว้ ผู้รับจ้างยินยอมให้คิดค่าปรับเป็น รายชั่วโมง (เศษของชั่วโมงให้นับเป็น 1 (หนึ่ง) ชั่วโมง) ในอัตราร้อยละ.........................(......................) ของค่าจ้างบำรุงรักษา (รายงวด) ตามสัญญา นับจากเวลาที่ครบกำหนดจนถึงเวลาที่ผู้รับจ้างได้เริ่มการซ่อมแซมแก้ไข หรือจนถึงเวลาที่ผู้รับจ้างดำเนินการซ่อมแซมแก้ไข แล้วเสร็จ แล้วแต่กรณีทั้งนี้หากผู้รับจ้างไม่ดำเนินการดังกล่าว ผู้ว่าจ้างมีสิทธิจ้างบุคคลภายนอกทำการซ่อมแซมแก้ไข โดยผู้รับจ้างจะต้อง ออกค่าใช้จ่ายในการจ้างบุคคลภายนอกซ่อมแซมแก้ไขแทนผู้ว่าจ้างทั้งสิ้น')::character varying as d6_3,
            concat('การจ้างบริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์ตามสัญญานี้ ไม่รวมถึงการเปลี่ยนแปลงลักษณะเฉพาะ ของคอมพิวเตอร์หรือส่วนประกอบที่ติดตั้งเพิ่มเติมภายหลังที่สัญญานี้มีผลบังคับและความเสียหายของคอมพิวเตอร์ซึ่งเกิดจากเหตุสุดวิสัยหรือเกิดจากความผิดของผู้ว่าจ้าง')::character varying as d6_4,
            concat('ข้อ 7 ความรับผิดของผู้รับจ้าง')::character varying as d7,
            concat('ผู้รับจ้างจะต้องรับผิดต่อผู้ว่าจ้างในกรณีที่ผู้รับจ้าง ผู้แทน ช่าง หรือลูกจ้างของผู้รับจ้างจงใจหรือประมาทเลินเล่อ หรือไม่มีความรู้ความชำนาญพอ กระทำหรืองดเว้นการกระทำใดๆ เป็นเหตุให้คอมพิวเตอร์ของผู้ว่าจ้างเสียหายหรือไม่อยู่ในสภาพที่ใช้การได้ดี โดยไม่อาจแก้ไขได้ โดยผู้รับจ้างจะต้องจัดหาคอมพิวเตอร์ ที่มีคุณภาพ ประสิทธิภาพ และความสามารถในการใช้งานไม่ต่ำกว่าของเดิม ชดใช้แทนหรือชดใช้ราคาคอมพิวเตอร์ในขณะที่เกิดความเสียหายในกรณีที่ไม่อาจจัดหาคอมพิวเตอร์ดังกล่าวชดใช้แทนได้ให้แก่ผู้ว่าจ้าง ภายในเวลาที่ผู้ว่าจ้างกำหนด')::character varying as d7_1,
            concat('นับตั้งแต่เวลาที่ผู้ว่าจ้างบอกกล่าวเป็นหนังสือให้ผู้รับจ้างจัดหาคอมพิวเตอร์มาชดใช้ให้แทนหรือชดใช้ราคาคอมพิวเตอร์ ตามวรรคหนึ่ง ผู้รับจ้างยินยอมให้ผู้ว่าจ้างปรับเป็นรายวันในอัตราร้อยละ…….(8)..…...(…………..….) ของค่าจ้างตามสัญญานี้ ซึ่งคิดเป็นเงิน.........................บาท (...........................) ต่อวัน จนกว่าผู้ว่าจ้างบอกเลิกสัญญาตามสัญญาข้อ 10 และหากผู้ว่าจ้างต้อง ใช้คอมพิวเตอร์ที่อื่นประมวลผล ผู้รับจ้างยินยอมชดใช้ค่าใช้จ่ายเพื่อการดังกล่าวทั้งสิ้นแทนผู้ว่าจ้างอีกด้วย')::character varying as d7_2,
            concat('นอกจากนี้ ผู้รับจ้างจะต้องรับผิดชอบต่ออุบัติเหตุ ความเสียหาย หรือภยันตรายใดๆ อันเกิดจากการปฏิบัติงาน ของผู้รับจ้างและต้องรับผิดต่อความเสียหายจากการกระทำหรืองดเว้นกระทำโดยผิดกฎหมาย หรือโดยจงใจหรือประมาทเลินเล่อของ ผู้แทนช่าง หรือลูกจ้างของผู้รับจ้างอีกด้วย')::character varying as d7_3,
            concat('ข้อ 8 หลักประกันการปฏิบัติตามสัญญา')::character varying as d8,
            concat('ในขณะทำสัญญานี้ ผู้รับจ้างได้นำหลักประกันเป็น ',(select string_agg(concat(pgtl.guaranty_type_name, ' เป็นจำนวนเงิน ' ,TO_CHAR(pgm.collateral_amt, 'FM999G999G999D00'), ' บาท ','( ', po_baht_text(pgm.collateral_amt::numeric), ' ) '),', ')
                                                from po_guaranty_master pgm 
                                                left join po_guaranty_detail pgd on pgm.guaranty_master_id = pgd.guaranty_master_id 
                                                left join po_guaranty_type pgt on pgd.guaranty_type = pgt.guaranty_type_code 
                                                        left join po_guaranty_type_lang pgtl on pgt.guaranty_type_id = pgtl.guaranty_type_id 
                                                                and lower(pgtl.language_code) = lower(p_lin_id)
                                                where pgm.status <> 'C' and pgm.ref_doc_type = a.doc_type and pgm.ref_doc_no = a.po_no),
                    'ซึ่งเท่ากับร้อยละ…..…(10)…..…(…….......….....) ของราคาค่าจ้างตามสัญญา มามอบให้แก่ผู้ว่าจ้างเพื่อเป็นหลักประกันการปฏิบัติตามสัญญานี้')::character varying as d8_1,
            concat('(11) กรณีผู้รับจ้างใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญา หนังสือค้ำประกันดังกล่าว จะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทยหรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ ประกอบกิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกัน ตามประกาศของธนาคารแห่งประเทศไทยตามรายชื่อบริษัทเงินทุน ที่ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนด หรืออาจเป็นหนังสือ ค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้และจะต้องมีอายุการค้ำประกันตลอดไป จนกว่าผู้รับจ้างพ้นข้อผูกพันตามสัญญานี้')::character varying as d8_2,
            concat('หลักประกันที่ผู้รับจ้างนำมามอบให้ตามวรรคหนึ่งจะต้องมีอายุครอบคลุมความรับผิดทั้งปวงของผู้รับจ้าง ตลอดอายุสัญญา ถ้าหลักประกันที่ผู้รับจ้างนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลงหรือมีอายุ ไม่ครอบคลุมถึงความรับผิดของผู้รับจ้าง ตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม ผู้รับจ้างจะต้องหาหลักประกันมาเปลี่ยนให้ใหม่หรือหลักประกันเพิ่มเติมให้มีจำนวนครบถ้วน ตามวรรคหนึ่งมามอบให้แก่ผู้ว่าจ้าง ภายใน................(..…..……...) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ว่าจ้าง')::character varying as d8_3,
            concat('หลักประกันที่ผู้รับจ้างนำมามอบไว้ตามข้อนี้ ผู้ว่าจ้างจะคืนให้แก่ผู้รับจ้างโดยไม่มีดอกเบี้ยเมื่อผู้รับจ้างพ้นจากข้อผูกพัน และความรับผิดทั้งปวงตามสัญญานี้แล้ว')::character varying as d8_4,
            concat('ข้อ 9 การจ้างช่วง')::character varying as d9,
            concat('ผู้รับจ้างจะต้องไม่เอางานทั้งหมดหรือแต่บางส่วนแห่งสัญญานี้ไปจ้างช่วงอีกทอดหนึ่ง เว้นแต่การจ้างช่วงงานแต่บางส่วน ที่ได้รับอนุญาตเป็นหนังสือจากผู้ว่าจ้างแล้ว การที่ผู้ว่าจ้างได้อนุญาตให้จ้างช่วงงาน แต่บางส่วนดังกล่าวนั้น ไม่เป็นเหตุให้ผู้รับจ้างหลุดพ้น จากความรับผิดหรือพันธะหน้าที่ตามสัญญานี้ และผู้รับจ้าง จะยังคงต้องรับผิดในความผิดและความประมาทเลินเล่อของผู้รับจ้างช่วง หรือของตัวแทนหรือลูกจ้างของผู้รับจ้างช่วงนั้นทุกประการ')::character varying as d9_1,
            concat('กรณีผู้รับจ้างไปจ้างช่วงงานแต่บางส่วนโดยฝ่าฝืนความในวรรคหนึ่ง ผู้รับจ้างต้องชำระค่าปรับให้แก่ผู้ว่าจ้าง เป็นจำนวนเงินในอัตราร้อยละ.......(12)…...…(...................) ของวงเงินของงานที่จ้างช่วงตามสัญญาทั้งนี้ไม่ตัดสิทธิผู้ว่าจ้างในการ บอกเลิกสัญญา')::character varying as d9_2,
            concat('ข้อ 10 การบอกเลิกสัญญา')::character varying as d10,
            concat('หากผู้ว่าจ้างเห็นว่าผู้รับจ้างไม่อาจปฏิบัติตามสัญญาได้ หรือผู้รับจ้างผิดสัญญาข้อใดข้อหนึ่ง หรือตกเป็นผู้ล้มละลาย ผู้ว่าจ้างมีสิทธิบอกเลิกสัญญาได้ และมีสิทธิจ้างผู้รับจ้างรายใหม่เข้าทำงานของผู้รับจ้างให้ลุล่วงไปการใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบ สิทธิของผู้ว่าจ้างที่จะเรียกร้องค่าเสียหายและค่าใช้จ่าย ใดๆ (ถ้ามี) จากผู้รับจ้าง')::character varying as d10_1,
            concat('ในกรณีที่ผู้ว่าจ้างใช้สิทธิบอกเลิกสัญญา ผู้ว่าจ้างมีสิทธิริบหรือบังคับจากหลักประกัน การปฏิบัติตามสัญญาตามข้อ 8 เป็นจำนวนเงินทั้งหมดหรือแต่บางส่วน ตามแต่จะเห็นสมควรได้ทันที นอกจากนั้น ผู้รับจ้างจะต้องรับผิดชอบในค่าเสียหายซึ่งเป็นจำนวน เกินกว่าหลักประกันการปฏิบัติตามสัญญา และค่าเสียหายต่างๆ ที่เกิดขึ้น รวมทั้งค่าใช้จ่ายที่เพิ่มขึ้นในการทำงานนั้นต่อให้แล้วเสร็จตามสัญญา ซึ่งผู้ว่าจ้างจะหักเอาจากจำนวนเงินใดๆ ที่จะจ่ายให้แก่ผู้รับจ้างก็ได้')::character varying as d10_2,
            concat('การที่ผู้ว่าจ้างไม่ใช้สิทธิเลิกสัญญาดังกล่าวตามวรรคหนึ่งไม่เป็นเหตุให้ผู้รับจ้างพ้นจากความรับผิดตามสัญญา')::character varying as d10_3,
            concat('ข้อ 11 การบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย')::character varying as d11,
            concat('ในกรณีที่ผู้รับจ้างไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ว่าจ้าง ผู้รับจ้างต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ว่าจ้างโดยสิ้นเชิง ภายในกำหนด....................(......................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ว่าจ้าง หากผู้รับจ้างไม่ชดใช้ให้ถูกต้องครบถ้วน ภายในระยะเวลาดังกล่าวให้ผู้ว่าจ้างมีสิทธิที่จะหักเอาจากจำนวนเงินค่าจ้าง ที่ต้องชำระหรือบังคับจากหลักประกันการปฏิบัติ ตามสัญญาได้ทันที')::character varying as d11_1,
            concat('หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากจำนวนเงินค่าจ้างที่ต้องชำระ หรือจากหลักประกันการปฏิบัติ ตามสัญญาแล้วยังไม่เพียงพอ ผู้รับจ้างยินยอมชำระส่วนที่เหลือที่ยังขาดอยู่จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด.............(.................) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ว่าจ้าง')::character varying as d11_2,
            concat('หากมีเงินค่าจ้างตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ว่าจ้างจะคืนให้แก่ผู้รับจ้างทั้งหมด')::character varying as d11_3,
            concat('ข้อ 12 การงดหรือลดค่าปรับ หรือการขยายเวลาในการปฏิบัติตามสัญญา')::character varying as d12,
            concat('ในกรณีที่มีเหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้ว่าจ้าง หรือเหตุสุดวิสัย หรือเกิดจากพฤติการณ์ อันหนึ่งอันใดที่ผู้รับจ้างไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนดในกฎกระทรวงซึ่งออกตามความในกฎหมาย ว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ ทำให้ผู้รับจ้างไม่สามารถปฏิบัติตามเงื่อนไขและกำหนดเวลาในข้อ 5 ข้อ 6 หรือข้อ 7 ได้ ผู้รับจ้างจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าว พร้อมหลักฐานเป็นหนังสือให้ผู้ว่าจ้างทราบ เพื่อของดหรือลดค่าปรับหรือขยายเวลาทำการ ตามสัญญาภายใน 15 (สิบห้า) วันนับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนดในกฎกระทรวงดังกล่าวแล้วแต่กรณี')::character varying as d12_1,
            concat('ถ้าผู้รับจ้างไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้รับจ้างได้สละสิทธิเรียกร้องในการที่จะของดหรือ ลดค่าปรับ หรือขยายเวลาทำการตามสัญญาโดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณีเหตุเกิดจากความผิดหรือความบกพร่องของฝ่าย ผู้ว่าจ้างซึ่งมีหลักฐานชัดแจ้งหรือผู้ว่าจ้างทราบดีอยู่แล้วตั้งแต่ต้น')::character varying as d12_2,
            concat('การงดหรือลดค่าปรับ หรือขยายกำหนดเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของผู้ว่าจ้างที่จะพิจารณา ตามที่เห็นสมควร')::character varying as d12_3,
            concat('สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยานและคู่สัญญาต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ')::character varying as d12_4,
            concat('(ลงชื่อ) ',deapprove.emp_name,' ผู้ว่าจ้าง')::character varying as sys1,
            concat('( ',a.sign_posi,' ',a.approve_posi,' )')::character varying as sys2,
            concat('(ลงชื่อ)…………..........……………..ผู้รับจ้าง')::character varying as sys3,
            concat('(…………………………….…)')::character varying as sys4,
            concat('(ลงชื่อ)…………..........……………..พยาน')::character varying as sys5,
            concat('(…………………………….…)')::character varying as sys6,
            concat('(ลงชื่อ)…………..........……………..พยาน')::character varying as sys7,
            concat('(…………………………….…)')::character varying as sys8,
            concat('วิธีปฏิบัติเกี่ยวกับสัญญาจ้างบริการบำรุงรักษาและซ่อมแซมแก้ไขคอมพิวเตอร์')::character varying as f0,
            concat('(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ')::character varying as f1,
            concat('(2) ให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก หรือรัฐวิสาหกิจ ข เป็นต้น')::character varying as f2,
            concat('(3) ให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับมอบอำนาจ เช่น นาย ก. อธิบดีกรม……………… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………………..')::character varying as f3,
            concat('(4) ให้ระบุชื่อผู้รับจ้าง')::character varying as f4,
            concat('ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด')::character varying as f4_1,
            concat('ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่')::character varying as f4_2,
            concat('(5) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f5,
            concat('(6) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f6,
            concat('(7) ให้กำหนดในอัตราระหว่างร้อยละ 0.025 – 0.035 ของราคาตามสัญญาต่อชั่วโมง')::character varying as f7,
            concat('(8) อัตราค่าปรับตามสัญญาข้อ 7 ให้กำหนดเป็นรายวันในอัตราระหว่างร้อยละ 0.01-0.10 ตามระเบียบ กระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. 2560 ข้อ 162 ส่วนกรณีจะปรับร้อยละเท่าใดให้อยู่ในดุลพินิจ ของหน่วยงานของรัฐผู้ว่าจ้างที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่จ้างซึ่งอาจมีผลกระทบต่อการที่ผู้รับจ้างจะหลีกเลี่ยง ไม่ปฏิบัติตามสัญญา แต่ทั้งนี้การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย')::character varying as f8,
            concat('(9) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐ เมื่อลงนาม ในสัญญา เพื่อเป็นการประกันความเสียหายที่อาจจะเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้')::character varying as f9,
            concat('(1) เงินสด')::character varying as f9_1,
            concat('(2) เช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน 3 วันทำการ ')::character varying as f9_2,
            concat('(3) หนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนดโดยอาจเป็นหนังสือ ค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้')::character varying as f9_3,
            concat('(4) หนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาต ให้ประกอบกิจการเงินทุน เพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคารแห่งประเทศไทย แจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือ ค้ำประกันของธนาคารที่คณะกรรมการนโยบายกําหนด')::character varying as f9_4,
            concat('(5) พันธบัตรรัฐบาลไทย ')::character varying as f9_5,
            concat('(10) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบการะทรวงการคลัง ว่าด้วยการจัดซื้อจัดจ้าง และการบริหารพัสดุภาครัฐ พ.ศ. 2560 ข้อ 168')::character varying as f10,
            concat('(11) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f11,
            concat('(12) อัตราค่าปรับตามสัญญาข้อ 9 กรณีผู้รับจ้างไปจ้างช่วงบางส่วนโดยไม่ได้รับอนุญาต จากผู้ว่าจ้างต้องกำหนดค่าปรับ เป็นจำนวนเงินไม่น้อยกว่าร้อยละสิบของวงเงินของงานที่จ้างช่วงตามสัญญา')::character varying as f12,
            case when deapprove.personal_id is not null and deapprove.signature_image_id is not null
                then concat((select sp.parameter_value  from su_parameter sp 
                                where sp.parameter_group_code = 'ContentPath'
                                and sp.parameter_code = 'SignatureURL')
                                ,'?PersonalId=',deapprove.personal_id,'&ContentId=',deapprove.signature_image_id)
                else null end::character varying as recipient_sign_image,
            deapprove.emp_name::character varying AS sign_name
    from po_pur_ord_master a 
    left join ap_member am on a.ap_member_id = am.ap_member_id 
            left join ap_member_lang aml on aml.ap_member_id = am.ap_member_id and lower(aml.language_code) = lower(p_lin_id)
			left join db_prefix_lang aml2 on aml2.prefix_id = aml.prefix_id 
					and lower(aml2.language_code) = lower(p_lin_id)
    left join db_employee_name(p_lin_id) deapprove on deapprove.emp_id = a.sign_id
    where a.pur_ord_master_id = p_pur_ord_master_id;
    END;
$function$
;
