drop function report_pood16;--get full_name ap_member report_pood16

CREATE OR REPLACE FUNCTION erp.report_pood16(p_lin_id character varying, p_pur_ord_master_id integer)
 RETURNS TABLE(pur_ord_master_id integer, h1 character varying, h2 character varying, h3 character varying, d1 character varying, d1_1 character varying, d2 character varying, d2_1 character varying, d3 character varying, d3_1 character varying, d3_2 character varying, d3_2_1 character varying, d3_2_2 character varying, d3_2_3 character varying, d3_2_4 character varying, d3_2_5 character varying, d3_3 character varying, d3_4 character varying, d3_5 character varying, d4 character varying, d4_0 character varying, d4_1 character varying, d4_2 character varying, d4_3 character varying, d4_4 character varying, d4_5 character varying, d4_6 character varying, d4_f1 character varying, d4_f2 character varying, d4_f3 character varying, d5 character varying, d5_1 character varying, d5_2 character varying, d5_3 character varying, d6 character varying, d6_1 character varying, d6_2 character varying, d6_3 character varying, d6_4 character varying, d7 character varying, d7_1 character varying, d7_2 character varying, d7_3 character varying, d7_4 character varying, d7_5 character varying, d7_6 character varying, d7_7 character varying, d7_8 character varying, d8 character varying, d8_1 character varying, d8_2 character varying, d8_3 character varying, d8_4_1 character varying, d8_4_2 character varying, d8_4_3 character varying, d8_5 character varying, d9_1 character varying, d9_1_1 character varying, d9_1_2 character varying, d9_1_3 character varying, d9_1_4 character varying, d9_2 character varying, d9_2_1 character varying, d9_2_2 character varying, d9_2_3 character varying, d9_2_4 character varying, d10 character varying, d10_1 character varying, d10_2 character varying, d10_3 character varying, d10_4 character varying, d11 character varying, d11_1 character varying, d12 character varying, d12_1 character varying, d12_2 character varying, d13 character varying, d13_1 character varying, d13_2 character varying, d14 character varying, d14_1 character varying, d15 character varying, d15_1 character varying, d15_2 character varying, d16 character varying, d16_1 character varying, d16_2 character varying, d17 character varying, d17_1 character varying, d17_2 character varying, d17_3 character varying, d18 character varying, d18_1 character varying, d18_2 character varying, d18_3 character varying, d19 character varying, d19_1 character varying, d20 character varying, d20_1 character varying, d20_2 character varying, d20_3 character varying, d20_4 character varying, sys1 character varying, sys2 character varying, f0 character varying, f1 character varying, f2 character varying, f3 character varying, f4 character varying, f4_1 character varying, f4_2 character varying, f5 character varying, f6 character varying, f7 character varying, f8 character varying, f8_1 character varying, f9 character varying, f9_1 character varying, f10 character varying, f11 character varying, f12 character varying, f13 character varying, f14 character varying, f15 character varying, f16 character varying, f16_1 character varying, f16_2 character varying, f16_3 character varying, f16_4 character varying, f16_5 character varying, f17 character varying, f18 character varying, f19 character varying, f20 character varying, f21 character varying, recipient_sign_image character varying, sign_name character varying)
 LANGUAGE plpgsql
AS $function$
BEGIN
    RETURN QUERY
select a.pur_ord_master_id::integer as pur_ord_master_id,
		concat('สัญญาเลขที่ ', a.ref_no)::character varying as h1,
		concat(
			'สัญญาฉบับนี้ทำขึ้น ณ ',
			(select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
			' ตำบล/แขวง ',
			(select get_sub_district_name(dcl.language_code,dcl.sub_district_id) from db_company_lang dcl
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' อำเภอ/เขต ',
			(select get_district_name(dcl.language_code,dcl.district_id) from db_company_lang dcl 
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' จังหวัด ',
			(select get_province_name(dcl.language_code,dcl.province_id) from db_company_lang dcl
			where dcl.company_code = a.company_code and lower(dcl.language_code) = lower(p_lin_id)),
			' ',
			(select po_format_date_thai('เมื่อวันที่','เดือน','พ.ศ.',a.po_date::date,p_lin_id )),
			' ระหว่าง ',
			(select l.company_name from db_company_lang l where l.company_code = a.company_code and lower(l.language_code) = lower(p_lin_id)),
			' โดย ',
			(select signde.emp_name from db_employee_name(p_lin_id) signde where signde.emp_id = a.sign_id),
			' ',
			a.sign_posi,
			' ',
			a.approve_posi,
			' ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ซื้อ” ฝ่ายหนึ่ง กับ ',
			case 
				when am.juristic_type = 'Y' -- นิติบุคคล
					then (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),
										' อยู่บ้านเลขที่ ',am.house_no,' ถนน ',am.road ,
										' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
										' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
										' จังหวัด ',get_province_name(p_lin_id,am.province_id),
										' ผู้ถือบัตรประจำตัวประชาชนเลขที่ ',
										am.tax_id,
										' ดังปรากฏตามสำเนาบัตรประจำตัวประชาชนแนบท้ายสัญญานี้ ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ขาย” อีกฝ่ายหนึ่ง'
										))
				else (select concat(coalesce(aml.full_name, coalesce(aml2.prefix_abbreviation, aml2.prefix_name), ' ', aml.first_name, ' ', aml.last_name),' ซึ่งจดทะเบียนเป็นนิติบุคคล ณ …………………………………………………………………………………… ',
										'มีสำนักงานใหญ่อยู่เลขที่ ',am.house_no,' ถนน ',am.road ,
										' ตำบล/แขวง ',get_sub_district_name(p_lin_id,am.sub_district_id),
										' อำเภอ/เขต ',get_district_name(p_lin_id,am.district_id),
										' จังหวัด ',get_province_name(p_lin_id,am.province_id),
										' โดย ………………………………………………… ผู้มีอำนาจลงนามผูกพันนิติบุคคลปรากฏตามหนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท ………… ลงวันที่ ………………………… (5) (และหนังสือมอบอำนาจลงวันที่ ………………………… ) แนบท้ายสัญญานี้ (6) ซึ่งต่อไปในสัญญานี้เรียกว่า “ผู้ขาย” อีกฝ่ายหนึ่ง'
										))
			end
		)::character varying as h2,
		concat('คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้')::character varying as h3,
		concat('ข้อ 1 คำนิยาม')::character varying as d1,
		concat('“โปรแกรมคอมพิวเตอร์” หมายความว่า คำสั่ง ชุดคำสั่งหรือสิ่งอื่นใดที่นำไปใช้กับ เครื่องคอมพิวเตอร์เพื่อให้ เครื่องคอมพิวเตอร์ทำงานหรือเพื่อให้ได้รับผลอย่างหนึ่งอย่างใด ทั้งนี้ ไม่ว่าจะเป็นภาษาโปรแกรมคอมพิวเตอร์ในลักษณะใดที่ซื้อขาย และอนุญาตให้ใช้สิทธิตามสัญญานี้ “สื่อ” หมายความว่า วัตถุซึ่งมีโปรแกรมคอมพิวเตอร์บันทึกอยู่')::character varying as d1_1,
		concat('ข้อ 2 ข้อตกลงซื้อขายและอนุญาตให้ใช้สิทธิ')::character varying as d2,
		concat('ผู้ซื้อตกลงซื้อ และผู้ขายตกลงขาย และอนุญาตให้ใช้สิทธิโปรแกรมคอมพิวเตอร์พร้อมด้วยสื่อและคู่มือการใช้ โปรแกรมคอมพิวเตอร์',
				' เป็นราคาทั้งสิ้น ',TO_CHAR(a.gs_aft_disc, 'FM999G999G999D00'),' บาท ',' ( ',po_baht_text(a.gs_aft_disc::numeric),' )',
				' ซึ่งได้รวมภาษีมูลค่าเพิ่มจำนวน ',TO_CHAR(a.total_vat_amt, 'FM999G999G999D00'),' บาท ',' ( ',po_baht_text(a.total_vat_amt::numeric),' )',
				' ตลอดจนภาษีอากรอื่น ๆ และค่าใช้จ่ายทั้งปวงด้วยแล้ว รายละเอียดโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิเป็น ไปตามเอกสารแนบท้ายสัญญาผนวก 1'
				)::character varying as d2_1,
		concat('ข้อ 3 การรับรองและการอนุญาตให้ใช้สิทธิ')::character varying as d3,
		concat('3.1 ผู้ขายรับรองและยืนยันว่าผู้ขายเป็นเจ้าของลิขสิทธิ์ รวมถึงสิทธิในทรัพย์สินทางปัญญาอื่นใดและมีสิทธิแต่ผู้เดียว อย่างสมบูรณ์โดยปราศจากภาระผูกพันใดๆอันจะทำให้เสื่อมสิทธิในโปรแกรมคอมพิวเตอร์หรือคู่มือการใช้หรือสิ่งอื่นใดที่เกี่ยวข้องกับ โปรแกรมคอมพิวเตอร์และ/หรือผู้ขายรับรองและยืนยันว่ามีอำนาจในการอนุญาตให้ผู้ซื้อ ใช้สิทธิในโปรแกรมคอมพิวเตอร์คู่มือการใช้ หรือสิ่งอื่นใดที่เกี่ยวข้องกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้โดยชอบด้วยกฎหมาย')::character varying as d3_1,
		concat('3.2 ผู้ขายตกลงอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ในหลายลักษณะหรือลักษณะใดลักษณะหนึ่งเพียง ลักษณะเดียวดังนี้')::character varying as d3_2,
		concat('  ใช้โปรแกรมคอมพิวเตอร์หนึ่งชุดกับเครื่องคอมพิวเตอร์เครื่องใดเครื่องหนึ่ง (Single License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ในขณะเดียวกันไม่เกิน….……..(…….…...) คน')::character varying as d3_2_1,
		concat('  ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ที่บรรจุโปรแกรมคอมพิวเตอร์จำนวน….……………....(………..…………..) เครื่อง (Volume License) โดยมีผู้ใช้โปรแกรมคอมพิวเตอร์ที่บรรจุในเครื่องคอมพิวเตอร์แต่ละเครื่องในขณะเดียวกันไม่เกิน ….……..…... (…………..……..) คน')::character varying as d3_2_2,
		concat('  ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์หลักในระบบเครือข่าย เพื่อทำให้เครื่องคอมพิวเตอร์ จำนวน….……..…...(…………..…………..) เครื่อง สามารถใช้โปรแกรมคอมพิวเตอร์ได้ ในขณะเดียวกัน (Network License)')::character varying as d3_2_3,
		concat('  ใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ของผู้ซื้อได้ โดยไม่จำกัดจำนวน ในขณะเดียวกัน (Corporate License)')::character varying as d3_2_4,
		concat('  อื่น ๆ ….………...')::character varying as d3_2_5,
		concat('(7) 3.3 กำหนดระยะเวลาอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ เริ่มต้นตั้งแต่วันที่ผู้ซื้อได้รับมอบ โปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วน และสิ้นสุดวันที่………….………..………….. รวมเป็นเวลา….…….......(…………..……..) ปี ….……….... (………………..) เดือน ….………...(…..…………..) วัน')::character varying as d3_3,
		concat('3.4 ในกรณีที่ผู้ขายเป็นผู้มีอำนาจอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์ ตามสัญญานี้ ผู้ขายได้นำเอกสารหลักฐานเกี่ยวกับการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ดังกล่าว ซึ่งออกโดยเจ้าของลิขสิทธิ์ มามอบให้แก่ผู้ซื้อในขณะลงนามในสัญญานี้')::character varying as d3_4,
		concat('เอกสารหลักฐานที่แสดงว่าผู้ขายเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ซึ่งผู้ขายจะต้องนำมามอบ ให้แก่ผู้ซื้อตามวรรคหนึ่งจะต้องมีข้อความที่แสดงให้เห็นว่าในกรณีที่ผู้ขายเลิกกิจการหรือถูกเพิกถอนการอนุญาตให้ใช้สิทธิในโปรแกรม คอมพิวเตอร์ตามสัญญานี้จากเจ้าของลิขสิทธิ์เจ้าของลิขสิทธิ์จะยอมผูกพันตามสัญญานี้แทนผู้ขายหรือจัดให้ผู้มีอำนาจอนุญาตให้ ใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นผูกพันตามสัญญานี้แทนผู้ขาย และอนุญาตให้ผู้ซื้อใช้สิทธิในโปรแกรมคอมพิวเตอร์โดยผู้ซื้อไม่ต้อง เสียค่าใช้จ่ายใดๆ ทั้งสิ้น')::character varying as d3_5,
		concat('ข้อ 4 เอกสารอันเป็นส่วนหนึ่งของสัญญา')::character varying as d4,
		concat('เอกสารแนบท้ายสัญญาดังต่อไปนี้ ให้ถือเป็นส่วนหนึ่งของสัญญานี้')::character varying as d4_0,
		concat('4.1 ผนวก 1 …(รายละเอียดและราคาโปรแกรมคอมพิวเตอร์ที่ซื้อขาย และการอนุญาตให้ใช้สิทธิพร้อมสื่อและคู่มือ)...')::character varying as d4_1,
		concat('4.2 ผนวก 2 ...(รายการคุณลักษณะเฉพาะ)...')::character varying as d4_2,
		concat('4.3 ผนวก 3 … (รายละเอียดการทดสอบการใช้งานโปรแกรมคอมพิวเตอร์)...')::character varying as d4_3,
		concat('4.3 ผนวก 3 … (รายละเอียดการทดสอบการใช้งานโปรแกรมคอมพิวเตอร์)...')::character varying as d4_4,
		concat('4.5 ผนวก 5 …(รายละเอียดการให้บริการหลังการขาย)...')::character varying as d4_5,
		concat('4.6 ผนวก 6 …(รายละเอียดการแก้ไขพัฒนาโปรแกรมคอมพิวเตอร์ให้ดีขึ้น)...')::character varying as d4_6,
		concat('จำนวน......(......) หน้า')::character varying as d4_f1,
		concat('…….…………………………..ฯลฯ.…….…………………………..')::character varying as d4_f2,
		concat('ความใดในเอกสารแนบท้ายสัญญาที่ขัดหรือแย้งกับข้อความในสัญญานี้ ให้ใช้ข้อความ ในสัญญานี้บังคับ และในกรณีที่เอกสารแนบท้ายสัญญาขัดแย้งกันเอง ผู้ขายจะต้องปฏิบัติตามคำวินิจฉัยของผู้ซื้อ คำวินิจฉัยของผู้ซื้อให้ถือเป็นที่สุด และผู้ขายไม่มีสิทธิเรียกร้องราคา ค่าเสียหาย หรือค่าใช้จ่ายใดๆ เพิ่มเติมจากผู้ซื้อทั้งสิ้น')::character varying as d4_f3,
		concat('ข้อ 5 การส่งมอบ')::character varying as d5,
		concat('ผู้ขายจะต้องส่งมอบและติดตั้งโปรแกรมคอมพิวเตอร์ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้ให้มีคุณสมบัติถูกต้อง และครบถ้วนตามที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก 1 และผนวก 2 โดยให้พร้อมใช้งานได้ตามรายละเอียดการทดสอบที่กำหนดไว้ ในเอกสารแนบท้ายสัญญาผนวก 3 ให้แก่ผู้ซื้อ ณ '
				,a.rec_place,' ภายใน ',a.lead_time,' ( ',po_qty_text(a.lead_time::numeric),' )',' วัน ','นับถัดจากวันลงนามในสัญญา')::character varying as d5_1,
		concat('ในกรณีผู้ขายประสงค์จะนำโปรแกรมคอมพิวเตอร์รายการใดที่ต่างไปจากรายละเอียด ที่กำหนดไว้ในเอกสารแนบ ท้ายสัญญาผนวก 1 และผนวก 2 มาส่งมอบและติดตั้งให้ผู้ซื้อ ผู้ขายต้องได้รับความยินยอมเป็นหนังสือจากผู้ซื้อก่อนและโปรแกรมคอมพิวเตอร์ ที่จะนำมาส่งมอบดังกล่าวนั้น จะต้องมีคุณสมบัติไม่ต่ำกว่าที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก 1 และผนวก 2')::character varying as d5_2,
		concat('การส่งมอบโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ไม่ว่าจะเป็นการส่งมอบเพียงครั้งเดียว หรือส่งมอบหลายครั้ง ผู้ขายจะต้องแจ้งกำหนดเวลาส่งมอบแต่ละครั้งโดยทำเป็นหนังสือยื่นต่อผู้ซื้อ ณ ',a.rec_place,
				' ในวันและเวลาทำการของผู้ซื้อ ก่อนวันส่งมอบไม่น้อยกว่า ',a.lead_time,' ( ',po_qty_text(a.lead_time::numeric),' ) ','วันทำการของผู้ซื้อ'
				)::character varying as d5_3,
		concat('ข้อ 6 การตรวจรับ')::character varying as d6,
		concat('เมื่อผู้ซื้อได้ตรวจรับโปรแกรมคอมพิวเตอร์ที่ส่งมอบและเห็นว่าถูกต้องครบถ้วนตามรายละเอียดและคุณลักษณะเฉพาะ ของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก 1 และผนวก 2 แนบท้ายสัญญานี้และเงื่อนไขต่างๆ ของสัญญานี้แล้ว ผู้ซื้อจะออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เพื่อผู้ขายใช้เป็นหลักฐานประกอบการขอรับชำระราคาค่าโปรแกรมคอมพิวเตอร์')::character varying as d6_1,
		concat('ถ้าผลการตรวจรับปรากฏว่า โปรแกรมคอมพิวเตอร์ที่ผู้ขายส่งมอบไม่ถูกต้องครบถ้วน หรือไม่ตรงตามรายละเอียด และคุณลักษณะเฉพาะของโปรแกรมคอมพิวเตอร์แนบท้ายสัญญานี้ และเงื่อนไขต่างๆ ของสัญญานี้ หรือใช้งานได้ไม่ถูกต้องครบถ้วนตามข้อ 5 ผู้ซื้อทรงไว้ซึ่งสิทธิที่จะไม่รับโปรแกรมคอมพิวเตอร์นั้น ในกรณีเช่นว่านี้ ผู้ขายต้องนำโปรแกรมคอมพิวเตอร์นั้นกลับคืนโดยเร็วที่สุด เท่าที่จะทำได้และนำโปรแกรมคอมพิวเตอร์ใหม่มาส่งมอบให้แก่ผู้ซื้อ หรือต้องทำการแก้ไขให้ถูกต้องตามสัญญาด้วยค่าใช้จ่ายของผู้ขายเอง และระยะเวลาที่เสียไปเพราะเหตุดังกล่าว ผู้ขายจะนำมาอ้างเป็นเหตุขอขยายเวลาตามสัญญาหรือของดหรือลดค่าปรับไม่ได้')::character varying as d6_2,
		concat('(10) ในกรณีที่ผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ไม่ครบถ้วนหรือส่งมอบครบถ้วน แต่ใช้งานได้ไม่ถูกต้องตามที่กำหนด ไว้ในข้อ 5 แต่ไม่ถึงกับทำให้ระบบคอมพิวเตอร์ทั้งหมดใช้การไม่ได้ ผู้ซื้อจะตรวจรับโปรแกรมคอมพิวเตอร์เฉพาะส่วนที่ใช้งานได้ถูกต้อง ครบถ้วน โดยออกหนังสือแสดงการรับมอบโปรแกรมคอมพิวเตอร์เฉพาะส่วนนั้นก็ได้')::character varying as d6_3,
		concat('การตรวจรับจะสมบูรณ์ตามสัญญานี้ก็ต่อเมื่อผู้ซื้อได้ทดสอบโปรแกรมคอมพิวเตอร์ว่าสามารถปฏิบัติงานได้ เต็มความประสงค์ของผู้ซื้ออย่างถูกต้องครบถ้วน')::character varying as d6_4,
		concat('ข้อ 7 การชำระเงิน')::character varying as d7,
		concat('(11) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เมื่อผู้ซื้อได้รับมอบ โปรแกรมคอมพิวเตอร์ถูกต้องครบถ้วนตามข้อ 6 และผู้ขายได้อบรมเจ้าหน้าที่ของผู้ซื้อตามข้อ 11 เสร็จสิ้นแล้ว')::character varying as d7_1,
		concat('(12) ผู้ซื้อตกลงชำระราคาค่าโปรแกรมคอมพิวเตอร์และการอนุญาตให้ใช้สิทธิให้แก่ผู้ขาย เป็นงวดๆ รวม….………...(……………..) งวด ดังนี้')::character varying as d7_2,
		concat('งวดที่หนึ่งเป็นเงิน….…………...บาท (…………..……..………..) จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา ….………...(…………..…………..) เดือน')::character varying as d7_3,
		concat('งวดที่สองเป็นเงิน….…………...บาท (…………..………..……..) จะจ่ายให้เมื่อผู้ซื้อได้ใช้โปรแกรมคอมพิวเตอร์เป็นเวลา ….………...(…………..…………..) เดือน')::character varying as d7_4,
		concat('…….…………………………..ฯลฯ.…….…………………………..')::character varying as d7_5,
		concat('งวดสุดท้ายเป็นเงิน….……..…...บาท (…………..…………..) จะจ่ายให้เมื่อครบกำหนดระยะเวลาอนุญาตให้ใช้สิทธิ ในโปรแกรมคอมพิวเตอร์ดังกล่าว')::character varying as d7_6,
		concat('ในระหว่างงวดหนึ่งงวดใด หากผู้ขายเลิกกิจการ หรือถูกเพิกถอนการเป็นผู้มีอำนาจอนุญาตให้ใช้สิทธิ ในโปรแกรมคอมพิวเตอร์ตามสัญญานี้ ผู้ซื้อจะชำระเงินค่าโปรแกรมคอมพิวเตอร์ ที่ถึงกำหนดชำระในวันหรือหลังจากวันที่ผู้ซื้อได้ทราบ ถึงเหตุดังกล่าวให้แก่เจ้าของลิขสิทธิ์รายใหม่ หรือผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์รายอื่นซึ่งเจ้าของลิขสิทธิ์ จัดให้มาผูกพัน ตามสัญญานี้ แล้วแต่กรณีแทน')::character varying as d7_7,
		concat('การจ่ายเงินตามเงื่อนไขแห่งสัญญานี้ ผู้ซื้อจะโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขาย ชื่อธนาคาร............................................................สาขา........................................................................ชื่อบัญชี...........................................เลขที่บัญชี...............................................ทั้งนี้ผู้ขายตกลงเป็นผู้รับภาระเงินค่าธรรมเนียม หรือค่าบริการอื่นใดเกี่ยวกับการโอน รวมทั้งค่าใช้จ่ายอื่นใด (ถ้ามี) ที่ธนาคารเรียกเก็บและยินยอมให้มีการหักเงินดังกล่าวจากจำนวนเงินโอนในงวดนั้นๆ (ความในวรรคนี้ใช้สำหรับกรณีที่หน่วยงานของรัฐ จะจ่ายเงินตรงแก่ผู้ขาย (ระบบ Direct Payment) โดยการโอนเงินเข้าบัญชีเงินฝากธนาคารของผู้ขายตามแนวทางที่กระทรวงการคลังหรือ หน่วยงานของรัฐเจ้าของงบประมาณเป็นผู้กำหนดแล้วแต่กรณี)')::character varying as d7_8,
		concat('ข้อ 8 สิทธิของผู้ซื้อ')::character varying as d8,
		concat('8.1 ผู้ซื้อมีสิทธิที่จะใช้โปรแกรมคอมพิวเตอร์และคู่มือสำหรับผู้ใช้โปรแกรมคอมพิวเตอร์ตามสัญญานี้')::character varying as d8_1,
		concat('8.2 ผู้ซื้อขอรับรองว่าจะไม่ลบ ทำลาย ทำให้เสียหาย หรือทำให้ไม่ชัดเจนซึ่งเครื่องหมายหรือสัญลักษณ์ ')::character varying as d8_2,
		concat('8.3 ผู้ซื้อมีสิทธิทำสำเนาโปรแกรมคอมพิวเตอร์ได้.………….......(………..…………..) ชุด เพื่อป้องกันการสูญหายในการใช้โปรแกรมคอมพิวเตอร์กับเครื่องคอมพิวเตอร์ตามข้อ 8.4 ข. และอาจทำสำเนามากกว่านั้น หากได้รับความยินยอมเป็นหนังสือจากผู้ขาย')::character varying as d8_3,
		concat('8.4 ก. ผู้ซื้อมีสิทธิโอนโปรแกรมคอมพิวเตอร์ตามสัญญานี้ พร้อมด้วยสิทธิและหน้าที่ ตามสัญญาฉบับนี้ สำเนาทุกชุดของโปรแกรมคอมพิวเตอร์ และคู่มือการใช้ทั้งหมดให้ผู้รับโอน โดยที่ผู้รับโอนจะต้องตกลงผูกพันตามข้อตกลง ในสัญญานี้ทุกประการ')::character varying as d8_4_1,
		concat('ข. สัญญาฉบับนี้อนุญาตให้ผู้ซื้อบรรจุโปรแกรมคอมพิวเตอร์ลงในเครื่องคอมพิวเตอร์ หมายเลข............................................ของ............................................ที่อยู่เลขที่........................................... ถนน.......................................ตำบล/แขวง..........................................อำเภอ/เขต........................................... จังหวัด............................................')::character varying as d8_4_2,
		concat('ในกรณีที่ผู้ขายยินยอมให้มีการเคลื่อนย้ายโปรแกรมคอมพิวเตอร์จากเครื่องคอมพิวเตอร์ตามวรรคหนึ่ง ผู้ขายจะไม่เรียกร้องให้ผู้ซื้อชำระค่าโปรแกรมคอมพิวเตอร์เพิ่มเติมจากที่ได้ตกลงกัน ตามสัญญานี้')::character varying as d8_4_3,
		concat('8.5 ผู้ขายจะไม่โอนลิขสิทธิ์ใดๆ ในโปรแกรมคอมพิวเตอร์ หรือสิทธิการเป็นผู้มีอำนาจอนุญาตให้ผู้อื่นใช้สิทธิในโปรแกรมคอมพิวเตอร์ของตนทั้งหมดหรือแต่บางส่วนตามสัญญานี้ให้แก่บุคคลอื่น')::character varying as d8_5,
		concat('ข้อ 9 (ก) การรับประกันความชำรุดบกพร่อง')::character varying as d9_1,
		concat('9.1 ผู้ขายรับรองว่านับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วนสมบูรณ์ทุกประการ')::character varying as d9_1_1,
		concat('9.2 ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์ และอุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใดอันเกิดจาก ความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด เป็นเวลา...(13)...(……………..) ปี ….……...(………..) เดือน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โดยถูกต้องครบถ้วนตามสัญญา')::character varying as d9_1_2,
		concat('ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์ เกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงาน ได้อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์ อันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน…...…(14).….…...(……….……..…………..) วัน นับถัดจากวันที่ได้รับแจ้ง เป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น')::character varying as d9_1_3,
		concat('ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ')::character varying as d9_1_4,
		concat('ข้อ 9 (ข) การรับประกันความชำรุดบกพร่อง')::character varying as d9_2,
		concat('9.1 ภายในกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ 3.3 ผู้ขายรับประกันว่า นับตั้งแต่เวลาที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โปรแกรมคอมพิวเตอร์จะทำงานได้ตามที่กำหนดไว้ตามสัญญานี้ครบถ้วน สมบูรณ์ทุกประการ')::character varying as d9_2_1,
		concat('9.2 ผู้ขายยินยอมจะรับผิดชอบในความชำรุดบกพร่องหรือความเสียหายใดๆ ที่เกิดขึ้นแก่เครื่องคอมพิวเตอร์และ อุปกรณ์ต่อพ่วง หรือโปรแกรมคอมพิวเตอร์อื่นๆ หรือสิ่งอื่นใด อันเกิดจาก ความชำรุดบกพร่องของโปรแกรมคอมพิวเตอร์ ไม่ว่าจะเกิดด้วยเหตุใด ภายในกำหนดระยะเวลาอนุญาต ให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์ตามข้อ 3.3')::character varying as d9_2_2,
		concat('ภายในระยะเวลารับประกันตามวรรคหนึ่ง หากโปรแกรมคอมพิวเตอร์ เกิดการชำรุดบกพร่อง หรือไม่สามารถทำงานได้ครบถ้วนสมบูรณ์ตามที่กำหนดในสัญญานี้ ผู้ขายจะต้องซ่อมแซมแก้ไขโปรแกรมคอมพิวเตอร์ดังกล่าวให้ทำงานได้ อย่างสมบูรณ์ หรือติดตั้งโปรแกรมคอมพิวเตอร์ อันใหม่ที่ได้มาตรฐานและมีคุณสมบัติเท่ากับหรือดีกว่าโปรแกรมคอมพิวเตอร์ ที่ซื้อขายและอนุญาตให้ใช้สิทธิตามสัญญานี้โดยไม่ชักช้า ทั้งนี้ ไม่เกิน..…..…(15)………..(……..…..…………..) วัน นับถัดจากวันที่ได้รับแจ้ง เป็นหนังสือจากผู้ซื้อ โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อทั้งสิ้น')::character varying as d9_2_3,
		concat('ถ้าผู้ขายไม่จัดการซ่อมแซมแก้ไขหรือไม่ติดตั้งโปรแกรมคอมพิวเตอร์ให้ใหม่ภายในกำหนดเวลาดังกล่าว ผู้ซื้อมีสิทธิที่จะทำการนั้นเองหรือจ้างผู้อื่นทำการนั้นแทนผู้ขาย โดยผู้ขายต้องออกค่าใช้จ่ายทั้งสิ้นแทนผู้ซื้อ')::character varying as d9_2_4,
		concat('ข้อ 10 หลักประกันการปฏิบัติตามสัญญา')::character varying as d10,
		concat('ในขณะทำสัญญานี้ ผู้ขายได้นำหลักประกันเป็น ',(select string_agg(concat(pgtl.guaranty_type_name, ' เป็นจำนวนเงิน ' ,TO_CHAR(pgm.collateral_amt, 'FM999G999G999D00'), ' บาท ','( ', po_baht_text(pgm.collateral_amt::numeric), ' ) '),', ')
											from po_guaranty_master pgm 
											left join po_guaranty_detail pgd on pgm.guaranty_master_id = pgd.guaranty_master_id 
											left join po_guaranty_type pgt on pgd.guaranty_type = pgt.guaranty_type_code 
													left join po_guaranty_type_lang pgtl on pgt.guaranty_type_id = pgtl.guaranty_type_id 
															and lower(pgtl.language_code) = lower(p_lin_id)
											where pgm.status <> 'C' and pgm.ref_doc_type = a.doc_type and pgm.ref_doc_no = a.po_no),
				'ซึ่งเท่ากับร้อยละ.…..(17)..….(…………….……) ของราคา ค่าโปรแกรมคอมพิวเตอร์ มามอบไว้แก่ผู้ซื้อเพื่อเป็นหลักประกัน การปฏิบัติตามสัญญานี้')::character varying as d10_1,
		concat('(18) กรณีผู้ขายใช้หนังสือค้ำประกันมาเป็นหลักประกันการปฏิบัติตามสัญญาหนังสือค้ำประกันดังกล่าว จะต้องออกโดยธนาคารที่ประกอบกิจการในประเทศไทย หรือโดยบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาตให้ประกอบ กิจการเงินทุนเพื่อการพาณิชย์และประกอบธุรกิจ ค้ำประกันตามประกาศของธนาคารแห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ ธนาคารแห่งประเทศไทยแจ้งเวียนให้ทราบตามแบบที่คณะกรรมการนโยบายการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐกำหนดหรืออาจ เป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้ และจะต้องมีอายุ การค้ำประกันตลอดไปจนกว่าผู้ขายพ้น ข้อผูกพันตามสัญญานี้')::character varying as d10_2,
		concat('หลักประกันที่ผู้ขายนำมามอบให้ตามวรรคหนึ่ง จะต้องมีอายุครอบคลุมความรับผิดทั้งปวงของผู้ขาย ตลอดอายุสัญญา ถ้าหลักประกันที่ผู้ขายนำมามอบให้ดังกล่าวลดลงหรือเสื่อมค่าลง หรือมีอายุไม่ครอบคลุมถึงความรับผิดของผู้ขาย ตลอดอายุสัญญา ไม่ว่าด้วยเหตุใดๆ ก็ตาม รวมถึงกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ล่าช้าเป็นเหตุให้ระยะเวลาแล้วเสร็จหรือ วันครบกำหนดความรับผิด ในความชำรุดบกพร่อง (ถ้ามี) ตามสัญญาเปลี่ยนแปลงไป ผู้ขายต้องหาหลักประกันใหม่หรือหลักประกันเพิ่มเติม ให้มีจำนวนครบถ้วนตามวรรคหนึ่งมามอบให้แก่ผู้ซื้อภายใน….………...(……….………..) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ')::character varying as d10_3,
		concat('หลักประกันที่ผู้ขายนำมามอบไว้ตามข้อนี้ ผู้ซื้อจะคืนให้แก่ผู้ขายโดยไม่มีดอกเบี้ย เมื่อผู้ขายพ้นจากข้อผูกพันและ ความรับผิดทั้งปวงตามสัญญานี้แล้ว')::character varying as d10_4,
		concat('ข้อ 11 การอบรม')::character varying as d11,
		concat('ผู้ขายต้องจัดอบรมการใช้งานโปรแกรมคอมพิวเตอร์ตามสัญญานี้ให้แก่เจ้าหน้าที่ ของผู้ซื้อให้เข้าใจและสามารถ ใช้งานโปรแกรมคอมพิวเตอร์ได้เป็นอย่างดี มีประสิทธิภาพ โดยจะต้องส่งหลักสูตรตารางฝึกอบรมและสถานที่ฝึกอบรมให้ผู้ซื้อหรือ ผู้บริหารจัดการดูแลโปรแกรมคอมพิวเตอร์ที่ผู้ซื้อแต่งตั้งพิจารณาเห็นชอบเป็นหนังสือก่อนดำเนินการฝึกอบรมโดยต้องดำเนินการฝึกอบรมให้ แล้วเสร็จภายใน…...............(…….…………..) วัน นับถัดจากวันที่ผู้ซื้อได้รับมอบโปรแกรมคอมพิวเตอร์ โดยไม่คิดค่าใช้จ่ายในการจัดอบรม จากผู้ซื้อรายละเอียดของการอบรมให้เป็นไปตามเอกสารแนบท้ายสัญญาผนวก 4')::character varying as d11_1,
		concat('ข้อ 12 คู่มือการใช้โปรแกรมคอมพิวเตอร์และการให้คำแนะนำ')::character varying as d12,
		concat('12.1 ผู้ขายต้องจัดหาคู่มือการใช้โปรแกรมคอมพิวเตอร์ซึ่งเป็นต้นฉบับ จำนวน ......……....(…….………..) ชุด ให้เป็นกรรมสิทธิ์ของผู้ซื้อตามรายละเอียดที่กำหนดไว้ในเอกสารแนบท้ายสัญญาผนวก 1 พร้อมทั้งจะต้องปรับปรุงคู่มือดังกล่าวให้ทันสมัย ทุกครั้งที่มีการปรับปรุงโปรแกรมคอมพิวเตอร์ให้ทันสมัยขึ้นตลอดระยะเวลารับประกันตามข้อ 9.2 และต้องให้คำแนะนำในการใช้ โปรแกรมคอมพิวเตอร์และคู่มือการใช้โปรแกรมคอมพิวเตอร์เมื่อมีการปรับปรุงโปรแกรมคอมพิวเตอร์ดังกล่าว หรือเมื่อผู้ซื้อร้องขอตลอดเวลา ระยะเวลารับประกันโดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ')::character varying as d12_1,
		concat('12.2 ผู้ขายต้องให้คำแนะนำแก่ผู้ซื้อในการใช้โปรแกรมคอมพิวเตอร์และคู่มือการใช้ โปรแกรมคอมพิวเตอร์ รวมทั้งจะต้องดำเนินการต่างๆ เกี่ยวกับโปรแกรมคอมพิวเตอร์ ในลักษณะของ การให้บริการหลังการขาย ทั้งนี้ เพื่อให้โปรแกรมคอมพิวเตอร์ สามารถทำงานได้อย่างสมบูรณ์ ตลอดระยะเวลาการรับประกันตามข้อ 9.2 โดยไม่คิดค่าใช้จ่ายใดๆ จากผู้ซื้อ รายละเอียดเป็นไปตามที่กำหนด ในเอกสาร แนบท้ายสัญญาผนวก 5 แนบท้ายสัญญานี้')::character varying as d12_2,
		concat('ข้อ 13 การรักษาความลับทางการค้า')::character varying as d13,
		concat('13.1 ผู้ซื้อจะไม่เปิดเผยในลักษณะที่จะก่อให้เกิดความเสียหายแก่ผู้ขาย ให้บุคคลอื่นทราบซึ่งข้อมูลหรือ เทคนิคเกี่ยวกับโปรแกรมคอมพิวเตอร์ ซึ่งผู้ขายประสงค์ให้เป็นความลับทางการค้าของผู้ขาย และผู้ขายได้แจ้งให้ผู้ซื้อทราบเป็นหนังสือแล้ว')::character varying as d13_1,
		concat('13.2 ผู้ขาย ลูกจ้าง ตัวแทนหรือพนักงานของผู้ขายจะต้องไม่เอาไป เปิดเผย หรือใช้ข้อมูลและ/หรือสารสนเทศของผู้ซื้อ หรือกระทำด้วยประการใดๆ ให้บุคคลอื่นเอาไป เปิดเผย หรือใช้ข้อมูล และ/หรือสารสนเทศของผู้ซื้อ หรือเข้าถึงโดยมิชอบซึ่งข้อมูล และ/หรือสารสนเทศของผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ หรือล่วงรู้มาตรการป้องกันการเข้าถึงข้อมูล และ/หรือสารสนเทศของ ผู้ซื้อผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์ที่จัดทำขึ้นเป็นการเฉพาะ หรือกระทำด้วยประการใดๆ โดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์เพื่อดักรับไว้ซึ่งข้อมูลและ/หรือสารสนเทศของผู้ซื้อหรือผู้ที่เกี่ยวข้องกับผู้ซื้อที่อยู่ระหว่างการส่งผ่านโปรแกรมคอมพิวเตอร์และระบบคอมพิวเตอร์โดยไม่ชอบด้วยกฎหมาย หรือโดยไม่ได้รับความยินยอมเป็นหนังสือจากผู้ซื้อ')::character varying as d13_2,
		concat('ข้อ 14 ความคุ้มครองเกี่ยวกับลิขสิทธิ์')::character varying as d14,
		concat('ในกรณีที่บุคคลภายนอกกล่าวอ้างหรือใช้สิทธิเรียกร้องใดๆ ว่ามีการละเมิดลิขสิทธิ์หรือสิทธิบัตรหรือสิทธิใดๆ เกี่ยวกับ โปรแกรมคอมพิวเตอร์ตามสัญญานี้ โดยผู้ซื้อมิได้แก้ไขดัดแปลงไปจากเดิม หรือแก้ไขดัดแปลงโดยได้รับความยินยอมจาก ผู้ขายเป็นหนังสือ หรือเป็นกรณีที่กฎหมายอนุญาตให้ทำได้ ผู้ขายจะต้องปกป้องผู้ซื้อและดำเนินการทั้งปวงเพื่อให้การกล่าวอ้างหรือการเรียกร้องดังกล่าว ระงับสิ้นไปโดยเร็ว เพื่อให้ผู้ซื้อสามารถใช้โปรแกรมคอมพิวเตอร์นั้นต่อไปได้ ขั้นตอนดังกล่าวอาจรวมถึงการคืนโปรแกรมคอมพิวเตอร์ เดิมและเปลี่ยนโปรแกรมคอมพิวเตอร์ที่มีคุณสมบัติไม่ต่ำกว่าโปรแกรมคอมพิวเตอร์เดิมให้ใหม่ระยะเวลาที่เสียไปดังกล่าวไม่นับรวมเป็นระยะเวลาใช้สิทธิตามสัญญา หากผู้ขายไม่อาจกระทำได้ และผู้ซื้อต้องรับผิดชดใช้ค่าเสียหายต่อบุคคลภายนอก เนื่องจากผลแห่งการละเมิดลิขสิทธิ์ ดังกล่าว ผู้ขายต้องเป็นผู้ชำระค่าเสียหาย ค่าปรับ และค่าใช้จ่ายอื่นๆ รวมทั้งค่าฤชาธรรมเนียมและค่าทนายความแทน ผู้ซื้อทั้งนี้ผู้ซื้อจะแจ้งให้ผู้ขายทราบเป็นหนังสือในเมื่อได้มีการกล่าวอ้างหรือใช้สิทธิเรียกร้องดังกล่าวโดยไม่ชักช้า')::character varying as d14_1,
		concat('ข้อ 15 โปรแกรมคอมพิวเตอร์ที่ได้รับการแก้ไขพัฒนาให้ดีขึ้น')::character varying as d15,
		concat('ผู้ขายมีหน้าที่ต้องเสนอโปรแกรมคอมพิวเตอร์ที่ได้รับการพัฒนาให้ทันสมัยเป็นปัจจุบัน และดีขึ้นจากรากฐาน โปรแกรมคอมพิวเตอร์ตามสัญญานี้หรือจากรากฐานโปรแกรมคอมพิวเตอร์อื่น ที่เกี่ยวพันกับโปรแกรมคอมพิวเตอร์ตามสัญญานี้แก่ผู้ซื้อและ ผู้ซื้อมีสิทธิใช้โปรแกรมคอมพิวเตอร์รุ่น ที่พัฒนาทันสมัยเป็นปัจจุบันและดีขึ้นแล้วนี้ด้วย โดยผู้ซื้อไม่ต้องจ่ายค่าตอบแทนเพิ่มขึ้นและ/หรือ จะต้องจ่ายค่าตอบแทน ให้ผู้ขายตามจำนวนที่จะตกลงกันตามเอกสารแนบท้ายสัญญาผนวก 6')::character varying as d15_1,
		concat('การที่ผู้ซื้อเลือกที่จะใช้โปรแกรมคอมพิวเตอร์ที่ได้พัฒนาตามวรรคหนึ่งแล้ว ไม่มีผลกระทบต่อข้อสัญญาอื่นๆ')::character varying as d15_2,
		concat('ข้อ 16 การบอกเลิกสัญญา')::character varying as d16,
		concat('เมื่อครบกำหนดส่งมอบโปรแกรมคอมพิวเตอร์ตามข้อ 5 แล้ว ถ้าผู้ขายไม่ส่งมอบโปรแกรมคอมพิวเตอร์ให้แก่ผู้ซื้อ ถูกต้องครบถ้วนภายในกำหนดเวลาดังกล่าว หรือส่งมอบโปรแกรมคอมพิวเตอร์ไม่ตรงตามรายละเอียดและคุณลักษณะเฉพาะ ของโปรแกรมคอมพิวเตอร์ตามเอกสารแนบท้ายสัญญาผนวก 1 และผนวก 2 และเงื่อนไขต่างๆ ของสัญญานี้ หรือส่งมอบภายในกำหนด แต่ใช้งานไม่ได้ครบถ้วนตามข้อ 5 หรือผู้ขายผิดสัญญาข้อใดข้อหนึ่ง ผู้ซื้อมีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้การใช้สิทธิ บอกเลิกสัญญานั้นไม่กระทบสิทธิของผู้ซื้อที่จะเรียกร้องค่าเสียหายจากผู้ขาย')::character varying as d16_1,
		concat('ในกรณีที่ผู้ซื้อใช้สิทธิบอกเลิกสัญญา ผู้ซื้อมีสิทธิริบหรือบังคับจากหลักประกันตามข้อ 10 เป็นจำนวนเงินทั้งหมดหรือ แต่บางส่วนก็ได้ แล้วแต่ผู้ซื้อจะเห็นสมควร ตลอดจนมีสิทธิเรียกค่าเสียหายใดๆ อันเนื่องมาจากผู้ขายไม่ปฏิบัติตามสัญญานี้ และถ้าผู้ซื้อจัดซื้อโปรแกรมคอมพิวเตอร์จากบุคคลอื่น เต็มจำนวนหรือเฉพาะจำนวนที่ขาดส่งแล้วแต่กรณีภายในกำหนด….…(19)…... (…………..…………..) เดือน นับถัดจากวันบอกเลิกสัญญา ผู้ขายจะต้องชดใช้ราคาที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานี้ด้วย')::character varying as d16_2,
		concat('ข้อ 17 ค่าปรับ')::character varying as d17,
		concat('ในกรณีที่ผู้ซื้อยังไม่ใช้สิทธิบอกเลิกสัญญาตามข้อ 16 ผู้ขายจะต้องชำระค่าปรับให้ ผู้ซื้อเป็นรายวันในอัตราร้อยละ …..……(20)…..…...(….………………..………..) ของราคาโปรแกรมคอมพิวเตอร์ ที่ยังไม่ได้รับมอบ นับถัดจากวันครบกำหนดตามสัญญา จนถึงวันที่ผู้ขายได้นำโปรแกรมคอมพิวเตอร์มาส่งมอบให้แก่ผู้ซื้อจนถูกต้องครบถ้วน')::character varying as d17_1,
		concat('การคิดค่าปรับในกรณีผู้ขายส่งมอบโปรแกรมคอมพิวเตอร์ที่ตกลงซื้อขายและอนุญาตให้ใช้สิทธิเพียงบางส่วน หรือขาดส่วนประกอบส่วนใดส่วนหนึ่งไปหรือส่งมอบโปรแกรมคอมพิวเตอร์ทั้งหมด แต่ใช้งานไม่ได้ถูกต้องครบถ้วนตามข้อ 5 ซึ่งส่งผลให้ระบบคอมพิวเตอร์ทั้งหมดใช้งานไม่ได้ ให้ถือว่ายังไม่ได้ส่งมอบโปรแกรมคอมพิวเตอร์นั้นเลย และให้คิดค่าปรับเป็นรายวันจากราคาโปรแกรมคอมพิวเตอร์ทั้งชุด')::character varying as d17_2,
		concat('ในระหว่างที่ผู้ซื้อไม่ได้ใช้สิทธิบอกเลิกสัญญานั้น ถ้าผู้ซื้อเห็นว่าผู้ขายไม่อาจปฏิบัติ ตามสัญญาต่อไปได้ ผู้ซื้อจะใช้สิทธิบอกเลิกสัญญาและริบหรือบังคับจากหลักประกันตามข้อ 10 กับเรียกร้องให้ชดใช้ราคาที่เพิ่มขึ้นตามที่กำหนดไว้ในข้อ 16 วรรคสอง ก็ได้ และถ้าผู้ซื้อได้แจ้งข้อเรียกร้องให้ชำระค่าปรับไปยังผู้ขายเมื่อครบกำหนดส่งมอบแล้ว ผู้ซื้อมีสิทธิที่จะปรับผู้ขายจนถึงวันบอกเลิกสัญญา ได้อีกด้วย')::character varying as d17_3,
		concat('ข้อ 18 การบังคับค่าปรับ ค่าเสียหาย และค่าใช้จ่าย')::character varying as d18,
		concat('ในกรณีที่ผู้ขายไม่ปฏิบัติตามสัญญาข้อใดข้อหนึ่งด้วยเหตุใดๆ ก็ตาม จนเป็นเหตุให้เกิดค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแก่ผู้ซื้อ ผู้ขายต้องชดใช้ค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายดังกล่าวให้แก่ผู้ซื้อโดยสิ้นเชิงภายในกำหนด………………… .(…….……………...) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือ จากผู้ซื้อ หากผู้ขายไม่ชดใช้ให้ถูกต้องครบถ้วนภายในระยะเวลาดังกล่าว ให้ผู้ซื้อมีสิทธิที่จะหักเอาจากจำนวนเงินค่าโปรแกรมคอมพิวเตอร์ที่ต้องชำระ หรือบังคับจากหลักประกันการปฏิบัติตามสัญญาได้ทันที')::character varying as d18_1,
		concat('หากค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายที่บังคับจากเงินค่าโปรแกรมคอมพิวเตอร์ ที่ต้องชำระ หรือหลักประกันการปฏิบัติตามสัญญาแล้วยังไม่เพียงพอ ผู้ขายยินยอมชำระส่วนที่เหลือ ที่ยังขาดอยู่จนครบถ้วนตามจำนวนค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายนั้น ภายในกำหนด...........(............) วัน นับถัดจากวันที่ได้รับแจ้งเป็นหนังสือจากผู้ซื้อ')::character varying as d18_2,
		concat('หากมีเงินค่าโปรแกรมคอมพิวเตอร์ตามสัญญาที่หักไว้จ่ายเป็นค่าปรับ ค่าเสียหาย หรือค่าใช้จ่ายแล้วยังเหลืออยู่อีกเท่าใด ผู้ซื้อจะคืนให้แก่ผู้ขายทั้งหมด')::character varying as d18_3,
		concat('ข้อ 19 การส่งคืนโปรแกรมคอมพิวเตอร์')::character varying as d19,
		concat('เมื่อสัญญาสิ้นสุดลง ไม่ว่าจะในกรณีที่มีการเลิกสัญญา หรือกรณีครบกำหนดระยะเวลาการอนุญาตให้ใช้สิทธิ หากผู้ขายมีหนังสือร้องขอภายในกำหนดเวลา….…………..…......(…..……..…………..) วัน นับถัดจากวันที่สัญญาสิ้นสุดลง ผู้ซื้อจะส่งคืนโปรแกรมคอมพิวเตอร์และสำเนาโปรแกรมคอมพิวเตอร์ ตามสัญญานี้คืนให้กับผู้ขาย หากผู้ขายไม่ร้องขอภายในกำหนดเวลาดังกล่าว ให้ถือว่าสละสิทธิการรับคืนโปรแกรมคอมพิวเตอร์ตามสัญญานี้')::character varying as d19_1,
		concat('ข้อ 20 การงดหรือลดค่าปรับ หรือขยายเวลาส่งมอบ')::character varying as d20,
		concat('ในกรณีที่มีเหตุสุดวิสัย หรือเหตุใดๆ อันเนื่องมาจากความผิดหรือความบกพร่อง ของฝ่ายผู้ซื้อ หรือจากพฤติการณ์ อันหนึ่งอันใดที่ผู้ขายไม่ต้องรับผิดตามกฎหมาย หรือเหตุอื่นตามที่กำหนดในกฎกระทรวง ซึ่งออกตามความในกฎหมายว่า ด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ ทำให้ผู้ขายไม่สามารถส่งมอบโปรแกรมคอมพิวเตอร์ตามเงื่อนไขและกำหนดเวลา แห่งสัญญานี้ได้ผู้ขายมีสิทธิของดหรือลดค่าปรับหรือขยายเวลาตามสัญญาได้โดยจะต้องแจ้งเหตุหรือพฤติการณ์ดังกล่าวพร้อมหลักฐานเป็น หนังสือให้ผู้ซื้อทราบภายใน 15 (สิบห้า) วัน นับถัดจากวันที่เหตุนั้นสิ้นสุดลง หรือตามที่กำหนด ในกฎกระทรวงดังกล่าว แล้วแต่กรณี')::character varying as d20_1,
		concat('ถ้าผู้ขายไม่ปฏิบัติให้เป็นไปตามความในวรรคหนึ่ง ให้ถือว่าผู้ขายได้สละสิทธิเรียกร้อง ในการที่จะของดหรือลดค่าปรับ หรือขยายเวลาทำการตามสัญญา โดยไม่มีเงื่อนไขใดๆ ทั้งสิ้น เว้นแต่กรณี เหตุเกิดจากความผิดหรือความบกพร่องของฝ่ายผู้ซื้อซึ่งมีหลักฐาน ชัดแจ้งหรือผู้ซื้อทราบดีอยู่แล้วตั้งแต่ต้น')::character varying as d20_2,
		concat('การงดหรือลดค่าปรับหรือขยายเวลาทำการตามสัญญาตามวรรคหนึ่ง อยู่ในดุลพินิจของผู้ซื้อที่จะพิจารณา ตามที่เห็นสมควร')::character varying as d20_3,
		concat('สัญญานี้ทำขึ้นสองฉบับ มีข้อความถูกต้องตรงกัน คู่สัญญาได้อ่านและเข้าใจข้อความโดยละเอียดตลอดแล้ว จึงได้ลงลายมือชื่อพร้อมทั้งประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยาน และคู่สัญญาต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ')::character varying as d20_4,
		concat('(ลงชื่อ) ',deapprove.emp_name,' ผู้ซื้อ')::character varying as sys1,
		concat('( ',a.sign_posi,' ',a.approve_posi,' )')::character varying as sys2,
		concat('วิธีปฏิบัติเกี่ยวกับสัญญาซื้อขายและอนุญาตให้ใช้สิทธิในโปรแกรมคอมพิวเตอร์')::character varying as f0,
		concat('(1) ให้ระบุเลขที่สัญญาในปีงบประมาณหนึ่งๆ ตามลำดับ')::character varying as f1,
		concat('(2) ให้ระบุชื่อของหน่วยงานของรัฐที่เป็นนิติบุคคล เช่น กรม ก.กรม ก. หรือรัฐวิสาหกิจ ข. เป็นต้น')::character varying as f2,
		concat('(3) ให้ระบุชื่อและตำแหน่งของหัวหน้าหน่วยงานของรัฐที่เป็นนิติบุคคลนั้น หรือผู้ที่ได้รับมอบอำนาจ เช่น นาย ก. อธิบดีกรม……………… หรือ นาย ข. ผู้ได้รับมอบอำนาจจากอธิบดีกรม………………..')::character varying as f3,
		concat('(4) ให้ระบุชื่อผู้ขาย')::character varying as f4,
		concat('ก. กรณีนิติบุคคล เช่น ห้างหุ้นส่วนสามัญจดทะเบียน ห้างหุ้นส่วนจำกัด บริษัทจำกัด')::character varying as f4_1,
		concat('ข. กรณีบุคคลธรรมดา ให้ระบุชื่อและที่อยู่')::character varying as f4_2,
		concat('(5) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ ตามข้อเท็จจริง')::character varying as f5,
		concat('(6) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f6,
		concat('(7) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f7,
		concat('(8) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อ โดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ 3 วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ ไว้ตรวจรับของนั้น')::character varying as f8,
		concat('ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน')::character varying as f8_1,
		concat('(9) กำหนดเวลาส่งมอบจะต้องแจ้งล่วงหน้าไม่น้อยกว่ากี่วัน ให้อยู่ในดุลพินิจของผู้ซื้อ โดยตกลงกับผู้ขาย โดยปกติควรจะกำหนดไว้ประมาณ 3 วันทำการ เพื่อที่ผู้ซื้อจะได้จัดเตรียมเจ้าหน้าที่ ไว้ตรวจรับของนั้น')::character varying as f9,
		concat('ในกรณีที่มีการส่งมอบสิ่งของหลายครั้ง ให้ระบุวันเวลาที่ส่งมอบแต่ละครั้งไว้ด้วย และในกรณีที่มีการติดตั้งด้วย ให้แยกกำหนดเวลาส่งมอบ และกำหนดเวลาการติดตั้งออกจากกัน')::character varying as f9_1,
		concat('(10) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f10,
		concat('(11) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f11,
		concat('(12) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f12,
		concat('(13) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f13,
		concat('(14) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะ ของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย')::character varying as f14,
		concat('(15) ระยะเวลารับประกันและระยะเวลาแก้ไขซ่อมแซมจะกำหนดเท่าใด แล้วแต่ลักษณะ ของสิ่งของที่ซื้อขายกัน โดยให้อยู่ในดุลพินิจของผู้ซื้อ ทั้งนี้ จะต้องประกาศให้ทราบในเอกสารประกวดราคาด้วย')::character varying as f15,
		concat('(16) “หลักประกัน” หมายถึง หลักประกันที่ผู้รับจ้างนำมามอบไว้แก่หน่วยงานของรัฐ เมื่อลงนามในสัญญาเพื่อประกันความเสียหายที่อาจเกิดขึ้นจากการปฏิบัติตามสัญญา ดังนี้')::character varying as f16,
		concat('(1) เงินสด')::character varying as f16_1,
		concat('(2) เช็คหรือดราฟท์ที่ธนาคารเซ็นสั่งจ่าย ซึ่งเป็นเช็คหรือดราฟท์ลงวันที่ที่ใช้เช็คหรือ ดราฟท์นั้นชำระต่อเจ้าหน้าที่ หรือก่อนวันนั้นไม่เกิน 3 วันทำการ')::character varying as f16_2,
		concat('(3) หนังสือคํ้าประกันของธนาคารภายในประเทศตามตัวอย่างที่คณะกรรมการนโยบายกําหนด โดยอาจเป็นหนังสือค้ำประกันอิเล็กทรอนิกส์ตามวิธีการที่กรมบัญชีกลางกำหนดก็ได้')::character varying as f16_3,
		concat('(4) หนังสือค้ำประกันของบริษัทเงินทุนหรือบริษัทเงินทุนหลักทรัพย์ที่ได้รับอนุญาต ให้ประกอบกิจการ เงินทุนเพื่อการพาณิชย์และประกอบธุรกิจค้ำประกันตามประกาศของธนาคาร แห่งประเทศไทย ตามรายชื่อบริษัทเงินทุนที่ธนาคาร แห่งประเทศไทยแจ้งเวียนให้ทราบ โดยอนุโลมให้ใช้ตามตัวอย่างหนังสือค้ำประกันของธนาคารที่คณะกรรมการนโยบายกําหนด')::character varying as f16_4,
		concat('(5) พันธบัตรรัฐบาลไทย')::character varying as f16_5,
		concat('(17) ให้กำหนดจำนวนเงินหลักประกันการปฏิบัติตามสัญญาตามระเบียบกระทรวงการคลัง ว่าด้วยการจัดซื้อจัดจ้างและการบริหารพัสดุภาครัฐ พ.ศ. 2560 ข้อ 168 ทั้งนี้ จะต้องประกาศให้ทราบ ในเอกสารประกวดราคาด้วย')::character varying as f17,
		concat('(18) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f18,
		concat('(19) กำหนดเวลาที่ผู้ซื้อจะซื้อสิ่งของจากแหล่งอื่นเมื่อบอกเลิกสัญญาและมีสิทธิเรียกเงิน ในส่วนที่เพิ่มขึ้นจากราคาที่กำหนดไว้ในสัญญานั้น ให้อยู่ในดุลพินิจของผู้ซื้อโดยตกลงกับผู้ขาย')::character varying as f19,
		concat('(20) อัตราค่าปรับตามสัญญาข้อ 17 ให้กำหนดเป็นรายวันในอัตราตายตัวระหว่างร้อยละ 0.01 – 0.20 ของราคาพัสดุที่ยังไม่ได้ส่งมอบ ตามระเบียบกระทรวงการคลังว่าด้วยการจัดซื้อจัดจ้าง และการบริหารพัสดุภาครัฐ พ.ศ. 2560 ข้อ 162 ส่วนกรณีจะปรับร้อยละเท่าใด ให้อยู่ในดุลพินิจของหน่วยงานของรัฐผู้ซื้อที่จะพิจารณา โดยคำนึงถึงราคาและลักษณะของพัสดุที่ซื้อ ซึ่งอาจมีผลกระทบ ต่อการที่ผู้ขายจะหลีกเลี่ยงไม่ปฏิบัติตามสัญญา แต่ทั้งนี้ การที่จะกำหนดค่าปรับเป็นร้อยละเท่าใดจะต้องกำหนดไว้ในเอกสารเชิญชวนด้วย')::character varying as f20,
		concat('(21) เป็นข้อความหรือเงื่อนไขเพิ่มเติม ซึ่งหน่วยงานของรัฐผู้ทำสัญญาอาจเลือกใช้หรือตัดออกได้ตามข้อเท็จจริง')::character varying as f21,
		case when deapprove.personal_id is not null and deapprove.signature_image_id is not null
			then concat((select sp.parameter_value  from su_parameter sp 
							where sp.parameter_group_code = 'ContentPath'
							and sp.parameter_code = 'SignatureURL')
							,'?PersonalId=',deapprove.personal_id,'&ContentId=',deapprove.signature_image_id)
			else null end::character varying as recipient_sign_image,
		deapprove.emp_name::character varying AS sign_name
from po_pur_ord_master a 
left join ap_member am on a.ap_member_id = am.ap_member_id 
		left join ap_member_lang aml on aml.ap_member_id = am.ap_member_id and lower(aml.language_code) = lower(p_lin_id)
		left join db_prefix_lang aml2 on aml2.prefix_id = aml.prefix_id 
				and lower(aml2.language_code) = lower(p_lin_id)
left join db_employee_name(p_lin_id) deapprove on deapprove.emp_id = a.sign_id
where a.pur_ord_master_id = p_pur_ord_master_id;
    END;
$function$
;
